{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "main_input",
          0,
          0
        ],
        [
          "aux_input",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              25,
              6
            ],
            "dtype": "float32",
            "name": "main_input",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "main_input"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 9,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.009999999776482582,
                "l2": 0.0
              }
            },
            "kernel_size": [
              15
            ],
            "name": "conv1d_1",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_1"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 9,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.009999999776482582,
                "l2": 0.0
              }
            },
            "kernel_size": [
              5
            ],
            "name": "conv1d_2",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_2"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 9,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.009999999776482582,
                "l2": 0.0
              }
            },
            "kernel_size": [
              3
            ],
            "name": "conv1d_3",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_3"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 9,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.009999999776482582,
                "l2": 0.0
              }
            },
            "kernel_size": [
              1
            ],
            "name": "conv1d_4",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_4"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_1",
            "padding": "valid",
            "pool_size": [
              11
            ],
            "strides": [
              11
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_1"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_2",
            "padding": "valid",
            "pool_size": [
              21
            ],
            "strides": [
              21
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_2"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_3",
            "padding": "valid",
            "pool_size": [
              23
            ],
            "strides": [
              23
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_3"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_4",
            "padding": "valid",
            "pool_size": [
              25
            ],
            "strides": [
              25
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_4"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling1d_1",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_2",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_3",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_1"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_1"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "activation_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              2
            ],
            "dtype": "float32",
            "name": "aux_input",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "aux_input"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ],
              [
                "aux_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_2"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 15,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 10,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_3",
            "trainable": true,
            "units": 10,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_3"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_4",
            "trainable": true,
            "units": 1,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_4"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "dense_4",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "hash": "195051f40b64c8c1ae5e4e5b80234495b26ef221d5a53ba9e946ed742bb931f8",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      1,
      1,
      1,
      25,
      6
    ],
    [
      1,
      1,
      1,
      1,
      2
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            1,
            1,
            1,
            25,
            6
          ],
          "values": [
            "3Renv4Dv679vH6M/t12kPbDeQj6hvvW+QwsbQFa8Zb96FJW9PUocPj68bb+FRwo+SNHmPlPbGr6MKq2/gaMjv7vgxr8eEQbAWIGlvpol676Olpi+FkCOvxizKD75T5i/UXPFPjHzdz5+0ss+WXclQNqRdb82cfK/yPUHvokqIkDz/2o/L+ACQNJ3qj7KOWg/p0WHvSw8Nb+PNfI9e6InPhPoFT5bW5O/XhsIPy3lNr6c0mE+OhGYPz9eJL71WjG+W/2Uvy3rYT9h92E/mvN9PRJ3G78pHd++0chav7Pcoz5OB3I+Z7qDP7Erjr6m+9o9RaUHP2B75j65BxI+EwEiQLV3ZL4ak00/jaayvnw2nL9xIhnA8+4gv5hVNj+PfwS/CcQcPZOPt708bSw/egzpvk1BmD4JJAlAYlStvnkp8T5niqA/rVi2v4Z46z+baAa+caUgvwsaAz/fPB4+CH0BPpKUDz++WJI+XVq6vthZmD9cc8s+OqQEv3RBKD/AMgE/eie1Pp8Bzz8zoEW+GNyUvmIplb9Z5QPAu7OhvjHnDr+68IC/W3+PPkKUqD7vaPK74Xc2P/z/jz5d1jC91fH9v4CYEL8F39W++nKCP0KDGMBv/7q+bXkovwJbM71kz24/K/Rhv4K81j6t6Ds/aBuTvvo1OT/kZ3+/GUbev1fSjD6B2Vg+vai9P9o8oL+A0MU/WlYpv+IYpj9IGBu/fAmev6L8Cb8hm0G+o6MhPgIm8T7cRxPApTCUP88t4D9k8hm+4jAbPz9uoj4wW4K/1hPBPpaeGL8eis6+"
          ]
        },
        {
          "shape": [
            1,
            1,
            1,
            1,
            2
          ],
          "values": [
            "NUGMPzTVQr4="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            1,
            1,
            1
          ],
          "values": [
            "lK2GPw=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "conv1d_1": {
      "bias": [
        "6Xo1vH4vRbpwDJm7Zew8u7MXDT70cq498VTKOzZ8eD2tY5i7"
      ],
      "weights": [
        "gpT7N6hL6zf0aVM3pVzDt9DRZDdw/+C24NNotcULgLdp9P43UpkyOJHixbcLfOc3aiSRN3gn8TZ6nya3sBpht3IcQrfE4LU3WKJctnhcnzYGz263oczNtyFQ9De31qq39i9RN20MiLcZbY23sAUWN4BxhrSAKYU1LjGGt/bDKbh4iFY2yRE1OFuWi7eg2NS1sGgXt2z397bWmgi4DFB+N0a2qDd4eAG3MBWSNfk8xTer+7C33m1ON2L6I7jGsfc32M3Ft9m6sbekaqK23SiGt2QRdzdoLg22xEsTN+TRuja0HO22dsnKN8C8D7bMvqq3tLC2NuVI4Td6vVE3a4net2Bnrzekm9s3wMV8NyNfl7faG8M3tQjAt74jVrca41w3fD/UtuxraDd0xbg36Fy6NxeXCzhB1tA3ho49t7iGf7e874m29qYNOERZFTiEkfG26CZhtqBeR7VgNaM3PPEvN3f05bc/6IC33owWuJCLEzj2Ojw3vMHSt7xCAzgG8Jy3md6Kt7HS+Ddgjxc3vggbuAowDbibVIS3sI4lt7CCGbjKWQ04OOObt0C5ojSNBwK46NXLN+1DvbfDUsM3BELrNolLy7eM2RY4EoHYN/QyPTc6n+a3tPAmt+SSvLddgYi3AEdBtXrkBbjo7gg3UChWtxbiTrdsAu82Rumgt/h3ojeyL0u3up2KN+CFKTUnFNc30CR4NmLGoreP5Pc3tleNt8AuTLcc9xK4iNEnOBqlDTeHncO3DJQZOLp3aLdcDw035Dqat3CW3TWIVhs4C3X/t6df3rdeoTS3cmctOKJkNLh/HQA4cGihNjN547d610y3xM3ptrrcjbdCQrq3lsBINyWP47ecFB24klnZN+LMJLg2MAA4Lvgvt7CQt7botpQ3bptut928xDcAMKQxO+AcOETFk7cuJ5C3ABNotE+Chbd95Ag4lhxdtz0jyDcAwAYzHNRyt7onALjh4583l4fVN9Kn+rfWnt43rMAguKcBrTeYK2k2zt48uMFt9zeRM5i3",
        "KBQAOP61jzeVQ7G39LiKtkJlmzfAuJE04NetNuAf+DWgUiQ2yswZN75aBLi2ywG463L8Nz/JvTcAH6YzbpogN0eCybcao7w3GL5MNtSJ5raYWxi4APoqteRlcDeXQqy3+ZAiOAuntreGcBu3pSWht4SesTeNOpM30CektlEYwzftYes3BE3rt4C9IzTYsXW2/2rsN0/v2DfgNgq1kA6WtbirgLYg0+82SPzKNhgTcDcb9La3IECLNjb/KLdSZbG3vDaPNrKOEDhlA9K3R9IeOHCrSbYDOcC37hgGuKObxjfOtCC3AgJIt7WD77c2hcE35a6ztzitlTfwhPa1kDsfuCwiOLdoMpm2usWRtyCnH7adHTY4SVLwNwDrw7PCWFk3/DYbuDLeEDfQWNu1cHXUNo41ujeglww1Hq7Gt96hADiufR04sjA0OKoJLriaL0E3qSuWt9dq2DeWL/03wF4oNZhyOzbCaoM3cIiPttTdurdCC6Q3uhnQt7hFELjN49m3jtU/N7CIl7be+S2351Lot8FEpTfO5yg38KaMtm5hb7cgCIQ2AqAwN52w87cHndk3oDGjt3p30bcudTM3MGp1txoNETeH+rY3LBKTNoJtWTegPgU2KzeQt8BgyTR8hrY20jUluJgYKDjVux04bHd/N+PI7re06do2+h2xNxVd+Lf/CsM3MKLnteOgtzdf5OC33/iINzi0C7is9Sw3IAkcNbBFLjgAz8Y3ELWptQBz2rXaoAG4nUzJN5BoCrjZ+/U3ePqYNsDk/bWXDq23ZHqKNnzrnLaGJxq4RJEWuCBrAjjmEwe4gOmPNOI7bzdodLw2j3aat9XhFjiYPQi4xp7qt7oUIjjk76m2T0WoN0RK37bg1Gu26JQeN7M1yrdkTcS2vGvNuNaCKLkc8Rq5KxgvuZkTK7k//z+5or8FuXi2gLi7zE25hm8NuYbG6bgfYEW5nm7IuFnHDrlbify4eSA9uXNB0rjUFIK51sQ2uCYPGrnty2m5C4VtuecBh7g0XO64",
        "Wgy8uCtNkbk2lvW41a0gubEonbixsCS5Ai54uNycWrl1Gnq485KSuZDXMbm6a6e4D14nuQRNpbh2cz25z6uDuV43ebmmX/S4oT5Hub+3MLm0HTW5iQ0kuQLSUbnRPx25xhoNudS8s7jggBG5j+M2udIbE7k4NT+5FQOAuWpkqzgmSju4zDmwuYAqLLn+Xja5iqX1uETgQzfXRwS5mOFaufo34riTTTi5UK3auGihyLkEope4HZt6uKR02Tdd4g25GiFOudN4g7m+kwe5FvhYOBv3xbi4WFq5/98guUYzm7nmWQ+4OMNOuZZXhTjR0k65BuOeuD+sB7kcuMu4fn18uaog8DcpGG253jI4OTSYZTmG9xw5p39aOSLrsTjyjTc58PQ3OUPfPjmY/iE5eCNXOZU7+TgA2UA5YyxJOTBmNzkrEAI5+MMeOVzZODnKkDI5eS5aOQtRHzl2xws5BUIcOaDoljlYkhg5XUVjOcSdBDnglWE5docQOQJRTjkeEdw4gikYOWh4PTlyEVM5xJedODtnRTm/dhw52L5+OSzRsDluJm05uErPNdGHSDlk2d04O+57Oe0EiTnZoYA5Pva+OOA8WjnUfSU5fcxsOSf16Ti8NDc5nSdaOdcrSzl1TRo5D5tNOeSHkDeVnkM5QaiDOf8fZDliwVQ5peUzOYBj9Tg5CmM56TMkOfCtJDlMtEs5QSUlObC2fTkKq1Y5fH0iOT+NHjkiRWc5Zyk3OSDKQjkg3is5/CJIOZt9OTmewlE5XNsuObAEETlslzY53FE5OeQhFzmQH2E5n2NaOXxg8zi2ZUA52U1IOb/TUDnUWXQ5pmrzOe7CmznbxNU5Y3QMOrKSQjmcQxo65tzrOa4R5TkmyMs5+okFOs7Zljkx1DM6uozIOUDApTnHJtE5NjMEOuiL5Tjb2R06yn7eOUSC6Dm1JF45tG/eOR7mnjmgfjE6iJf+OVHtATqY1Lg5300XOt5Xfjlwyzg6mQTfOZotCTqAT5E5Ie0AOlfbrTlpQzQ6",
        "/ULxOXTBqTl3wtQ5OrLlOaLV7Dlnsg86Ogb5OWRgtDkpiPA5IEyIOX/q5DnaZ805PQLPOTOPIzo9gQs6ZvaDOVAgkzmMbPE5Us3xOTQqHTqLz5Q5P+TBOXDnVzkpyvI5FMEOOpFK+jlPyLk5v9sjOqO7xDld4s05wFQXOurFrznDP6A5lqcROl4dQzlCk9M52BfyOaEMqDk8e4859mghOmOQUTlwdLU5s2zzObOJrTn/V4Y5CWDEOeqrejm6KPc53M0POrZOqDlM+W45rgzMOaoliTmVFc850jiROF4kUDmswNM4oPWwN76gmTjUBUM5NtuNOM64UDlEKpE4wSwlOIKYozgQ+jc5+8ECOTMSnDljXqM40L0kt6hjujdhTD85Aq2xOZ0/XDmYnpU4Dp0bOcCBIrjWIgo54yaLOQjHUDgwWdw3cPi5OLg1hbhm7Iw4PbiBOd3oQjmCswY5h+6AOJGxIbhkQjc38xZrOIDIzjjJZy45YbAvOBhGqbh1Ypm3Dp5GuGB7gDks65q3opc0OB7gdrgLxYI4hIA1OJKaNjkjK744Qm6pONwXnbi0ibs32e+pt+ynJ7jELJ04/1RQORovpLjf53o4AuYguJDvPzZkC5a3PnHvODoMw7h9pPs4aaQnuPojhDl0zXc3y80RuLiHWLjnpxA5JmfaN2MZtjmTNxQ58qf0OP7YSTns9gi3HaH+OGVJETmKdNc4NWcIOYnJxDn0spy3HoUbOTjnkLf2NHY5SIKWOWumxDlTZ5c46RgCuKT5zTZo8DM4ALT3sxN0yrf5C7+3SU++NzG6xbdinHY36IQWtzSeIrhw5gY4kLehNS3zizcHhde3QFGWNMk1qrfr1u+3YoMNtxAI9DagX0K3wn34t5QRBbcISy03FVWDN9bfBjg5edI32bvmt6DaVDVmjcU3WPBvNrM53DdaAqu3BTEZuDRJR7d6iBy3AMsWtDhbMDYwSyA3JuZJt4CoDzST7Na3lFszN0SVWTevOMW3z2fYNyw7OThSA8Y3",
        "nmnFtzC0CTcuAFW3yzLJt4KCvTegBoS1JB2st4h+k7amUMY3AK1itkBQ1LQqGVk3xiAQN48t37dn3uk3dopDt6A/MThwYtu1qy21txb3PDdAu7a1nKYcOCAJdbck+5k2QCe3NoCfyrbD4tS3Ggknt5ToVjc/S+u30CeAtTRPKTi+30q3YjpYN8ToBTjYmSo2VJBuN4Qpqrb4GPW2gMeDttB4w7dsvN02"
      ]
    },
    "conv1d_2": {
      "bias": [
        "gSCKuYTCtLlFj5u9nTC0u0xePDyEvok9NqF9PCtRPb0856M9"
      ],
      "weights": [
        "AGAuMlazlbdGIYC3fqmmNwBoiDQk+U23tJRtN0gWb7YAfQC3VOX6N573qLeUlHc3WJ0It+YTiTdAsjW3/FSbNoADCjUokum2udq+tz9DFbicabM2BP0ZNwtgzzcunYe3QJ4GN0K2sjeSywA4RLVftwDUVjUAy7I0vBHwt1PQ7zcYrBk3LPCft7BJojaEbcm3oIZnNg4R2bcGjAS4YD7jNpwS77bQIoG3LDT8NxkNjDf8VZ43ZoOtNz5ZFLeE3qk2g0G8NywXP7cwbO033MrltgDy/rNuAto3YOrttZ5CEre2X4s3b6Pnt8Dk2zfQUOa1EViPN+6TwreIom625v3BtzQtoTZTXZy3xglAN7et/LfgcTW1SvIqt67cQrcKSwK4gIlaN9pnl7fcLRo3bjsoNzLhtLcsoN03TlIfuAWDpzcszWq35Raft6CzHTbpDZ038x3kNx5yuDcQG441SzgSOOfqxze3KdA3fpDdt3JYIDcOKW03JqiotxisIrZ4N0828E+8trYeBbjIWvc2WrACOO2itzcwXf21Sp+dtyog7reA2g40TjkOOKDPBLZAMiG1sUDANytxhLeOctG3wAbttjDAnzWc+0m31e6At0pQALd6EYK3CrYCOEtahzcw7rK1nNGEuVrnKLlBpiI3Ub7JuJQBlTiHEvK4FPsAuZhVArkAB0w1PIoTOGWzCTg+/M+4YKlNuTV2LrmW1t03eEryN20c2jc4aFS5ttjyuEG/NLk0cTO3jlcuOAuQ8ze0Rk+5bxu3uBp3QblqkTo4dhIXOEIfLDiZQ4C4TgQOuf39nDl+pzA55ozIPNelu7o0CXY5ArCdu83hGrwFCcG7HJWeOotJqrmCcj49zh0SuWD4p7vjL9W4usncOaCdOrmKRC86h+5PuUKTIT3nqYE6GDWEueiDTrnTWwu9RW8QucaTRL3oles5mMbiuWiR4DfgWBY5d+4nu4Gxej0psWm8M4BBPGOao7yKCgM7cAGGOdGOyjy/dAm9PXC4OardFjcs4mw4",
        "MR0ROdDivzvjaxK8vPDcOFZ+IzsU/8a6/nF+uVKe+bo6WGi5LJ9IuHE9ljjKKv27W/3DvNJqNDkQJbY8X5UNurJmgTsrqum5wmY2Nzrl9DeE3m+3IDKhNwBbk7WAhDe0JMwMt8Tu5beAW1K18WwLuGJ1VLf31/W3DqSlt6C1CLWA+yO1exKTN8QStTaIhG22tvFGtxCF5zegafi3+DMuOAykArcEpMi3qFAKt9IkRLcjzYK3LhhUNwgMBbYMm+03Bu8nuEsZBbkgPsY2YQGfuACNZLfsDci2QbsiuBp3krixK9Q3IIGyuMWwgbgxCFc4KF8duQ6WOzYISOC3fv+4uMwZDrcug9k3gJa2tKw2nDghUW65kBdtuQHLI7nTIVi4/ACJtwHTEzkCNoy5mzoLufDSCTj5Qcs2"
      ]
    },
    "conv1d_3": {
      "bias": [
        "zJDZPGdZHblNUsG7iIjDPSErhbm1vgw9QIaRPR85q70meAW8"
      ],
      "weights": [
        "/cjNvBi74TwsOpK8sJw+ub6i6rx/C2c8rJ2ivPYroLxwZec977d9uaLSrbh7MzO8GI7/ODNHcbvQ46W4Bm0qOeTT2rhYt/Q4iigQt1pSTTfoQOE3rmOot0LyS7cZMt+3tGYluMBN/DVG5fm38O6UNy3rgDdcLsU2bSaHtxg7A7iQsVu2UALAtpDTjjfMWgs4qHQDtx7yNLj0YPK2XFFFt1uc7rf0J6i3YM6MtZnLpLcJ1YY3FokaN5I0RDc0llG3Jkh9N/GVvrfyRz834qJQN1CHkbeAvvs25bnSuWRE2Lnaige6h7SnufjaxLkjEdy5urqZuUR207laOiO6iiyyubRR17kHl8u5r36oudGp2LnthQG6Wu/JuSu5ubn7Zri5Nt0muFBim7VYkco26yq/t3stiTfC6ZK36nQVuHrO8zfgO8e1JmMmt2VujbcQ4jc37OgWOEA29Lf0PLK3QB7rNZzo7bfOdp63vgcCu/G6mjvgLam7kIwhuVGGFLiUJZe5hyYHuETRZL2H6I+3nlaEN+ybgDzQno47+2i1O3yRhTpCi425DDpQvOoWbjyl9e432yzouEiv1DigwYa5h7yNt9cycrmS4RE6xQZPuShwTzkCOnS5tYcXuRgIDbm/vKA5bNBiudJfVDndhoW5azlKuWlRH7kE5jg53NSHt/w8IjeHJr+3qmVENwDeKrRG0hi4i2TIt/EOtzcXlv+3uwCXt6DUUjbOKWq36WuWt/AX77bqMlK36yXLN8AcpTT0ABu3Q/qrNzDXpbVrMPe32ATBt/A1gzXS82U35t48OLmr1bcGsDW3tngkN6auB7jczJe2/q0EuMpHLrfgVD435nkWt9sg+jcwlJg3"
      ]
    },
    "conv1d_4": {
      "bias": [
        "euhCvEVZQj1MVYw9hlsouhNawbxXltu6IcpTue9Vpbodvsq7"
      ],
      "weights": [
        "2ZbAN6DvmDdp3QW4gFNdtVU+/zeAW600MaDau2jAgbnfON244VyeOXY5zLgCno+9EEykN1GWhTljIgi6wIpDPZ9MgThiiFK84AVbNRn5hbek6X835DOZtgCK0bXC5Aw3nWhovF5WhbsJ3NA7bQp4PWERnDpyzhW8dT3ct6hPEbiy4Ci4oAJMtoCHSbRW2oo3etKSt4TxcTdgd9Y29J2Vt0BXjLdEXho4pJb6NoccDbiRDtu3wJXNtbl8PDgEcm03KmAAtyBGG7abEck35jJwt/JT9bcAHJY1"
      ]
    },
    "dense_1": {
      "bias": [
        "0s27PZ2VhDx/k6a7z/kQvb4icbs2DY4934kHPa3nubwkhJk9AAAAAIUyFT1OZrk90IhdvcpthbsgD4y9"
      ],
      "weights": [
        "vmAnvkI4jD53b6e+3OXQvVcckb4/4xY+FbC+PQJ8Mj75R3++UUGbPs2bgD7yQT4+xYORPG9av72m5RS9yjlSvsY5ab5J47Y98MdlvoJ1YT7P4bM+qSVJPZVIKL4AA5a8MJ0fPVdjUrzovV8+mLR5PYFHrT2rUl+89Cl0PRA6+T0AjhW92AqAvgKAJD17SBc+sQOVviGcpD5MKKU9vl75vTa2TT7Hy/s9jstXPjlJ2T0065W+1vssvW6hbT42XTI+ODJ0vYGcDz65oge+VPfuvWgNIj2TkYO+pK7lvYtbFr1eYCW+utZYPgeAFj6HBpI+eR/gPdUb6r1ZhCU9FVMrvjr5jD3aAZQ+BGCoPsGC2L225M4+lxAhvqnw2zxtjBc+ROy8vrz1Kj7057+9xCPjPbaWDT4RjJK7BsPxuwmA5r2PJa0+pNs+vpwA9L0fFYw8fsqKvj0zUD5OPSS9fPdpPpkepj5R1Bq+c4thPjsfmT4mO2++IsM2PoJQdb2L8hc8rbGMvlerBb3hNsM+OPacvcdypb1D3ZI+HMMUvn802j1ew8q+/0OFPvotpr0Q3TA+8Oe/PQfbOz5b2DM+TDAvvWPeT73o+VM+3v51PpqCTT5IY4M+eBtwPrBnp71ykoY+O81Pvn19gT5LcZA+Rn5uvuCQez2hATe+sCg1vgh9Jz196t28TlvovcEfC7ueIZ6+mPd6vdgbmb6zXnO+ED60vZILCb6K8Ay9FPKKvuYVUD4qGq8+7N1pvgdhjT4QguK7A7WCvpTQvjw4BiM+fERfPuO47z3meK09VrTHPnNolb6eYpu+fSWAvj04iz7Egt69PqMuvt2zlb5PimK+wC5KvfS6Or5tLAS9/QoFvtJ+Fju+ole+BnRfvaD+3r1MIQy+mFM+PXiWhL5lDhA+/qhPPrtJgD6YXDS9g4eOvtcPhT6yVVU+TH0MvgAchL14va2908TgPWuoU75T/Xq+yALjvXFnAT5K20q+2PxyvF5bMz73fSg+q+VavrZMiD4z4au+",
        "6vJvPvyZ+72A7Lw7phrhPXd8nD7brlO+OXWkPCw1TD3MYhA+YjJ7PQdSQT2TB4a+MRGjPhc9r7vPBXs+DhBOvs8TcL7pw6G+rkAfP+8eET/Fh5s+LyQtvkiUlz5V5i+95V2yPkIMyb2jNZY+gCh3PQq6P74qV40+NEJEPjjD+j4oqns+1VoJvK6B/7452uS+SJtPvnJSEr8vyB8+W52nPo3h671w9uY9kKPDPIz4AD9Y62c+OSx/PT14Kr6h+Ds+YtVMvgtCYL3L8am7CvVJPuC6m73QunC9MX0sPgZ3hr7uEbA8vvAivgg3ZT6jrus9c1QFvun2DT7Oskc+454YPna9GT5rA2k+CftNvdJrgj0S5qM+gISePoe0ir2HTEA+Am6nvjEffj5YRhE+DG7GvT89gr4wtDo++/0BPzOn+j70C/w+6oH2PSWsnT7UQJE4dc19Phe93j5Wj2i+jGTtvdvzJL5mIiC9um+UvYXT/T7W1hC+vlTEPrX0E75AM4S9Uf5OPqYM9z2a368+CsMBvio7hz7FaYq+uU+rPjFwrj2c7zc9LwIJPWaSkzwL/ya9yeCSPvMn972/4p6+y9aOvnmgQ74FqJo9VxvcvVJkmL6zVxu+hVuTvnV8MD4x5lm+2Jd7PmwUSb20V4q9qqrzPssEuz61s2m+HdkaPhC2Ej2ZRCk+HytlPrXMHj0pmIc+oNYYvJO8kT77gQk7w8laPvxaJD37v1U+iGYGPgCBUr40SOs4lxsAPmwrJT5c6+296UF2PpPlnr2/CL4+sNSLvuQkob5Lm6c+ARFVPDkmU77GzZa99kwmP7Ailj6UZLQ+ESc5vLmngT5IGGW+IMehPUJc175CiDS+h68hvhHk5b4JCRO8xNh0vhdmFD/ytLm+ieeWvUQncT6fp6S9rLW5vr+oTT0/mMA+FIL4vB3SiD1ggpI9j5qSvpDCpz5J/gw8KZdePkROMj1ROHi+4jcuvdi5Wr731Mg9oLN4vsnNjb4oTjo+wb+RveXkiz5N7pi+",
        "mMbAPRFZUD5V1+Y9wHctPH1ybz585oo9KO8DO5AwLr4DXDO+uUGPvq0ZhT6YSYu+aFhTvulMij6z8Ha+XqCrvkv7pL4V9U8+V1GIPm9LFj7oUX++d+8cvmpqkb7AEZo9YNLmPLERJ71G5Sq9d6FrPju3pD7R9+U9XPVHvggMejwseJ6+iKUDPoTpWb7TL4Q+t2r9PnUPBj9kl4c9GdoHv1bXrz6Qdsy7NTa/PhhDSz7z1pU+umwfvlZ6F7+Iygg+lnK+vorhCj4kvJ09fOS6vtx9274Vj588yOhcPqks2r5AA/k92NjEvs+cGz1mwiA/ArQ0PmZ6Yj1TFwQ/MxEoPjbqwL2RH4i+t9k7vrAYjz0kErg9IPVEvboSJD6LPd28j+vXPT4fXr0Opb87ubtBvvxU9D2boGm+AIYVva8JxD11mqm9ya+uv/1bNL+UWZi+IF8Kvh+Vzr/vr5o+wsgVvy9glD5t25w/KixzvnxnCD9JQoc/RCtnPqdX875kUMI96Ek7PiXhWL7rjoM+JemXPtd1hTukwwY+6whTvmjinD4kLOy9yN15PapmXD1oflq+Cm9Zvo59hj4YE4e9hI2OPa/woz50M2M+TlzcPe+OKb4ZhKm9JHoXvjmcpjwsc74+gCeWO9Fn6z3Nd9I8543MPQlPnb47yKm+S6GtPqac+j3tsYW+ONngPVCtnb7BSFe+d1GIPmkIkL7VvYs+5EYbPmz5Sr7KhQg80NtuvpGP2r0RBpM+wXQSPprAhD5uH5y9oM2EvJBLor4eTlq9UFBbPrr7qT6myZA8iFpzvYJFYj4Ydsc9zC20PZTrQ74kAym+lXVfvpS6oT0vbWQ+Q8kZPagrPr6jmY48rf6sPlZxeb5Hbgy+G2g6vklYoz2OT4o+U26hvQWMsL50gQU9QZNfPiHBmzuqWCK+PKXCPRrRHD4f/C4+MrOhvsovjj5JtCU+qJqZvkONyb0NhGA+PZYxvgcqjD6WfeG9"
      ]
    },
    "dense_2": {
      "bias": [
        "dmGPPWfJGT6tT328rnkGPvr7xrq+N6a96ChCPdscgjsmpaS7Ca+2vA=="
      ],
      "weights": [
        "L7mhPiVNxT7jJHq9F+3TPoNzNr3rztO+4Gz9vVzbEr0MaAk/G06tvi0cND8oswU/rWOPPlS7zr3UPYO+7l8Av3tcCr8aNSG/cpKIvasEFD9QJc+8ZgeXvolgKj8kAPo8xcp3vg7vv77H5XC/K7yBvrri2bvFUQc/aSstv8eJV7/PgB0+hqChvp1Exj74zMm+yua7Pp1CHz8dbC2+L/xkP0h0Nj+AnF4/2vtXP+joQr7PlxS+PxQFv+Dsyb6V22i/dbMePr7sOr/kh9g+HU1SPpEXLD5A7uw8nEyfPhJijj29vpU+/tXRPmjY5j6ZCVC9kRA8PpBudz1ibOq+x2PXPjUOK74fbK6+kfICvzYojT0MBEK+5khuPrziSb6+hGg/Rx0evbk+375FHvI+S1VGP6rPr75sn/G+4cJvPuQjjbz2NxA/ydQMPovawD15Tk299rP6vlVb6D6+Iew+hxJoPo7D7z6t3c+9F2nzvt7D475YkyO+eDs7PTBJjjzJPMY+BfqNPpYbOD6j37k+dnq7vqrUOr8Hel6+PvX0vtU9HD+jMmu9z+mCPoGzhT4Qna4+p5EBv7tcgr7WqU0+fafSPYO31rxt0xY+7FMZPhpMrj6wikQ+6YFRPHDOuD7gX4E+SWT+vl1hdz6Gag6+BkegvddzkD4bW5I+ype3vvszBr51CAG9sVHPPbUKGb2p2kk/lVLxPFyYXj47rBa+3HfSvg0DAL+QhAq/5zEyP0TgDT6lYMu+z22fvg/HkT76qkK+J5bOvoA9NLy/OL6+4lGXPu/UnL64hV49"
      ]
    },
    "dense_3": {
      "bias": [
        "u7SovB/zLr1KNbU8UUiTPVRMiroAAAAAKIaUPcZ/lj00qnK9AAAAAA=="
      ],
      "weights": [
        "sHgbvuxFZD7DmUS9lGz5PvQgij2MRPE+YejDPnYC9D4Qiqo90DKzviOriD7d3e2++ygPPn8Ewz7FuKC+By7xvhDuyD7qJIu8yFLNPkZ3Ub69QD6/KlJYPSXxkL9av4o/MhyUPpS0n7707iQ/PyqJP6WFir6q89Q+lb7QPt8JCr8uu50+DV/uPpD2Cb+qJwu/QZkpvn10mz4qr4++GFzCvgEOyLx2ZQs+8dvzPhVfg76UcgK+XEEEPwyPCb9TRt0+CzXiPrZlyz7tasy/HM/Dvkas7r/e3cY/GP1NPnCc/z4Cpag/rwa5P5gM7D54ukQ+Eli2P8NIs70LTos/lg+ov1pvrb6A4Z077CWcv7kYA7+5nOK+IPbbPseCdj8MSse+/BhKPzm9Q7+FygM/FHRjvuA5b78/tYy+36BcPoA2njxFaei+HNLgPrhpu75G4I69khWoPvGo8b7SxCY+ewOWPmRRKb5Ifj4+vwT2vn0kvj4BZdC+c8ISv4Br2Ly48/W9xxbhva43u76XTxi/WO3/PQ=="
      ]
    },
    "dense_4": {
      "bias": [
        "EiyRPQ=="
      ],
      "weights": [
        "7Wa3v2MZJb91iqe/pwV0Px0SFL+d2r2+c0GSP9/txD6r98u+NFEsvg=="
      ]
    }
  }
}
