{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "main_input",
          0,
          0
        ],
        [
          "aux_input",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              50,
              6
            ],
            "dtype": "float32",
            "name": "main_input",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "main_input"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              30
            ],
            "name": "conv1d_1",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_1"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              10
            ],
            "name": "conv1d_2",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_2"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              4
            ],
            "name": "conv1d_3",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_3"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              1
            ],
            "name": "conv1d_4",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_4"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_1",
            "padding": "valid",
            "pool_size": [
              21
            ],
            "strides": [
              21
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_1"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_2",
            "padding": "valid",
            "pool_size": [
              41
            ],
            "strides": [
              41
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_2"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_3",
            "padding": "valid",
            "pool_size": [
              47
            ],
            "strides": [
              47
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_3"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_4",
            "padding": "valid",
            "pool_size": [
              50
            ],
            "strides": [
              50
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_4"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling1d_1",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_2",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_3",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_1"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_1"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "activation_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              2
            ],
            "dtype": "float32",
            "name": "aux_input",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "aux_input"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ],
              [
                "aux_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_2"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 20,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 15,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_3",
            "trainable": true,
            "units": 10,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_3"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_4",
            "trainable": true,
            "units": 1,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_4"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "dense_4",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "hash": "d4e9504920801872984c1080f3048c445425a9f074d1d3960eea2c74a9d25d83",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      1,
      1,
      1,
      50,
      6
    ],
    [
      1,
      1,
      1,
      1,
      2
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            1,
            1,
            1,
            50,
            6
          ],
          "values": [
            "cMa/PDz92j2CEsQ+jmqhPg5ArD6un48+0ikKvp9hRL9TjS7A2yIDv1kKKT9IC+Q+/oFrPbPlHL46BUA+nH/BvkD6Cb9EZ6S/iALkv9kkW76u9jDAWzqnv4EIlT52Dq8/tDKVvv4Zfr9a59O/ZM3Zvn2UmD/izJa9yAsfvi09aj51m8c+Mg9Pv0ym2z93hX49yJwuvkiNub+kbyo/1BRUPyPDmTy24qY9chUUwIx5jj7j4bA/XBrRvi9bDkDWG3g/meE1vl6cTD+c0d09cn5CviAHUD/bKfC9NFBPv46F674rOQJA6OuXP90WNT/F/lY/AaBVP0YpKT5SEDA9HWELwB2jzr3GEv0+usCPPpWZ8z0N9Cy/5k1BP3+SNj8ugxk+sfVGP11eLT9KfYS+XMTYv1w6qT/PzRE/3mBMv7C1kz8vJVW/PT42PznXTr8ozLM+JbtsP2aejD9XlVQ+kiCyvSUvVL8g9ow/1XUBP82HIz6sWOW++LQbP8gN0z9zN56/kz+/vyTABj8REYq/JdXWvtNr7r7qlO4+j7NDPaaP8j7Yzs2+9ZhXPx9Iub9dEN0+JQCzPqPfEr+CONI/eg8DwIZFsr7BeZW/wIuJP7tYqL83mpi/h+iXPw+1mL/zFoS/nz6cv3a9Wb8DXyE/ZgUUvDZ46j+5UF2/IHGgvh0rNz+x9xTAWtwmPxPffz4kMco+qy2OP4GKcr8jnmq/ACt2P1JLTT+LFTE+coFWPyybsT8DKnq+FRBUPb7Hwj93mUXATsP9P2MOHj/nmJY+o81xPucORbs0qYg/4+WBvlF5Aj5xksI/cHsaP3nomj5SD5s+tUzGv45yAUAudUQ/VKqOv7y8CL9DBwbAWUdcP5zOO7+JCYM+y4EUvxS6gT/Es5S+KIvePna/dT+niYQ/QTsOv+DjDL9nH3Q+td5yP+/z6L5jQfW+1sp3P2DEMD/qgOm+7KbcPytrhL/K4CI/igkkv5j3FcAzM1E/uwiGPyEutb/RpAfAoGe6vzSQDcCLeCE+",
            "21srvy5jBD9hqZ6+BtrwPrSdpL/CmgtAlH3kPiLzID5SC8q+ZuY4v/gYDr3EuXS9yryKPqYR8r2idkm/yb80vue9LD+j8t2+kSfQPinghT0siSm/ihn6vSMELD8C+3w+MIkEv1XHdTzlbTHAMhjjvskE9L8NELc/Mk6/v+ko0D02XMQ+UDJOPzphXb+61Jc+Kp/yvoukCL+p1mK+gLcEP8Cvrb8QrOe+JXbKP129VL+2g6q8DMLYvyACbT8M1mA+IHhFP+KJ8D+//EU/pp+dPqsPaT9iTFI/78iMvpF7Bj/J4R3AFlwnP2F6Er+TzNK/dXv2PlJ33z5hhD4/g6+dPzj2Qr8b2cW+wcuDP19onz65vKM/bbLavq7STb126Qm/O88Wvp7NCz8Iap6/izNGPjYYSb/TN7C+AnhOv25qmD6Sb44/x6v2vxqASj2oTDu+7BZMPrT84b55A4+8UQVUv+Te6T4LAa+//EMkvzb/sD3E5im/OXW2P0D4iz/ltrC9A/RwviDim78EQQc+r/mDPrYLLj9DRdy+pLHcP/96DUB0obw+C/qKPlLZ7L/V3w6/"
          ]
        },
        {
          "shape": [
            1,
            1,
            1,
            1,
            2
          ],
          "values": [
            "+3eFvyDvMb8="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            1,
            1,
            1
          ],
          "values": [
            "hQUPQA=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "conv1d_1": {
      "bias": [
        "9H4NPBahFj1OrPC711LouJ7A/jrUh0c9VPyhPJSroD18Ani8bSk3Pe5F5Lo="
      ],
      "weights": [
        "93MnOwjXozsczNu7BwKlvICRADsqEDs6LT1TPPjGWDxrJwi8J2GevG19LztxQnk8yUmbPIfybLsjWRi5VleBu0ehGDzK5AA8q2aePDuNAbv06hc8lUwfvJnWlDtm7Vo8AxSNPB23WLt/qmg8Ka4IvOeVjDo8YbI7eVa3Oho8hrljwlu8CsrXu0E6cjtyWuE7L5jSuaJg2rvWIsk7qPgwPKi/1TvWCaI7WuUiPEXrS7zjbhs86nM4PBOTO7tZXLE8BK0OPINqPbzg9Tw8C1+VulYiWrwYC1U82bJru3in8LrIXfC73dqWu8T43rsX4R66M6mHPDNyBzymJwM8Tv3cO/g2WLsGdgK7HBuBPN1W7LpoNGW8jOViPAffrLvRtxw8J8zBOc2BYTuzfp+6gsj+O8HJ6bsZ/AY83IpBu/qNRTvsgRC6inO1OtvxD7xB6l28rhOxvHoJFrtdQhi8UgUsu5oKgbw4cnw7CouLvN7Phrx3JDW7T3yPvLBJt7zlmpm8dJ0DPCaUG7ydoOW72TRBO5FLqryWTb67KcyFu6M587urNDM8y5Pbux3rzbwfN1w8DvGePG5bATzrrXo60VTcu1BOKLx/yA+7+CcdPJoDXrya1PK8+emJPMRNTzwjrCU7kHuvOoh1vLxHaR69hf78OS43tDyVvHK7vSA+vHNDh7znz827FLbTOx4EmTsRBOQ7+fPOOtw09ruPl7W8EVljPINrqjutkAc6c2T4uzjPGbzD6Mm8TcUNPa1PbzwEIgo9pMNtO8q8gDwilSa6rFeGPFgM17sokZU8XqQXvCjFvzyoRVq8KEGCPEc7Hry3m++7lHfwO4V7hTz/x5k8zAkCPGo8oLx47iO8HBIHPVcVF7xJuvw8Zat/PMjgfjtE0a87Ow/4PBFbgLsQqsM85WPzPBTbzjzBNbg8CzThPNSanjzIs4W8RAGSPPs9Dj17ZQI9gtGzOyjJtTlT5uI7mwCnPMrum7uFEZ264x1NO3ZvFTvyEsQ73p9/PPH+RruHwlS6",
        "7+mjO6sQIzsyVYA7Ni+ZPGgA87rNZgs6Yq2WO691JDuM4Ew6UNxhPBwPpbp0PoE6xzbCOprSizvFKdE6jqSBPL0dibrfQSo7clonO7OQjzskCGq5TkRVPDSAmLr4Ld46XTdWO0VpjDtredg5gdskPOqT2bpLLSc7uKASO4OAqjvTSoC6ksPSO6d5x7r45YU7egFxO6gcvDt8dNI61p0GPGZudLoDhZ07rRqZO4MIvjsL3qE6zkOTO74CzLni9Zg7RzgdO0kOQjsjxC+7Ya8uOd6WCTuV8To7ISVhO7+lE7tPHpe7xdx7u/lu2jtUHwA7J94pO1jg2rpafTm7v53ZOukxGjxeCo24b5UVuy1uizvG4IC6EbzkO3iZ9DtLdPm6A7Weu3Jm+TsgRrm6JXIcPNcinjvGSa27XpZeuJOt3jvaqkG7JsevOygPrztXf4C7S4meOaIcQTsEo4y6UH5qOzgjpzv5xmC7mAe9ub2mlzsRbek4LAmdO0asLztiOGy76FEMOsHV1TuwTxY74ha1O0fb3joW+H+6Xy+bu5AYGzx0UAs8xM3/O/NiNbsM1Qk7zFoGuzNhUTyiqDc8ufjLOw+TDrwqQIE7MobrO7Rdujz58K482dwhPI9kQ7zc3CA7EIp+PDL2kjyXcrI8ydC0O3LZD7xVs2m7KDLDO2FUIzssnFM8O+bruybG2TqPmI68CK0ZPBKCmjqKoAw7j2jsuxU5FTyk9JW8tT6yPJFdIjxANyo88ww8u+l46DtE2ti6WbIiPJydoboMGI489hTfuyONE7xumRk80JgOvDl3R7zHepM8fWp3uv0IrbppvCc8dJoqu4zVgLsXZ5w8v0yGPIGuojyDk0888neAOwL0RzzXc6Q8cILTPFRumju/Oig8NwNEPPtJarp/SDq8ccuGOv3ShLw51Fq8thwgPCJno7voDVK7Z3utO05hX7zycAG8YM/IO91OPrz09GG7beCFu/RKKLsTZCk7PuFpPJaIM7zwLDu8LncdvHndAbustRw7",
        "zT90PJf88rvSsw+8T1bbuwhWfjtoa6q6l4tIPFfWsbscd5K8wTB/u8Lmpzs02A88PxUNPA1Mjrw1pMO87mZNO9RnBTw5XLK6RfSBPPkHlLw3krK8ZLFMOk9hiTzgtpA8/pjhO3lN1bwnkPi8HdSYO37Mnjz0Cog8VibFOtHgvLxT6cK73D8LvO7/PDxVmcI7YjrgOUQflLz+wIC8XtZQO1xbdzwJlcY8ultgPD8+h7ymV9y8xiqTu847STwgaqg8O4ViPK3sErxCbOC80MDAuxaPQjw3aSI931pcPNp1WrsxSu28Dki0uzMPnTwTvMI8ikdVvPCpjbujaJS89JytvMncQzxzaA08ae28vCw7Xzp6eOk7+wk4vBAre7wZGn67SLvevJy4jjyw2Ee8Q8FMPJ+PAjxf3mw7rwKFvOnWHTzOBlO8xTL/O9EnhDxp0y261lgGvB76pLtxUWC8nHmfO1GIAD1bGCq8AuEHvK8lvrtOTaU7ze7PuklppDwMUTc7gBAgPGPUnzvJa5A7BqoiOzryjTu19lM8ldLOu+uKFDu1z466mQDOOqHgXrtFbc88wy9TvPK7lzxU1qo8YR80PAT4Nzx7cPy7RhzGu6TtFzwYeIc8J1iiO64+37pXxbC88UQ2PJFb6bqievo7LtrYOlzzM7nMmr28gJC1up0tbzvGipI8pWvCu0rE+TujSLS72jmEu3naRDv0TY+7YeMpu3heRjyrb088zuw7vBFkSjxhw6A7ncR9PNZfnTyRZ3A8cFQHOj7HiDwv3YM7eqp9OzApaDyfrmi86Qjnu/0qX7vnowW8fwADu2ZcHTw9F5G8v1r7iKS/9YgOUPyIIwgIidk/oIj2ceCIHs/viMYm+YgUggCJwmYEiXDUnYiVQeGIA3z3iFEc9YhAz/qIihcKie/Eo4hcH+2IksHuiF5B8IiyIfuIUskKicnnqIgu/vCIjt3ziIAW/ogBoP+IYsYHiU7cuIj3Au6Ic2T+iG0x+Ijl2/qITxIJiSXsv4gf4u6I",
        "o9T7iA4G9ohxyAGJwVcFiWpXwoi9pfGIJHT4iM2W/4hxfvOIr1kAifcu0YjEyfyIeYkAiZ3A8ojwaP6IgJoBiSd92IhIZvWI6CD7iKfA84iM+v6IIpD1iPWW5IhecwGJPlD8iIag7oi1wfiI/tUAiS+/34iu0faI/u/6iLel8YjktgGJbn35iJ6h6IjpEP6IhTP3iIJK64iVyAOJVakAiULC34iGEg+JTiX3iGVV9YgZog2JXsAAiZum3ogAmwoJ0+H0iJNU94jduwOJVu79iMp624h5JBIJ47D5iCo47oieHQqJDlP+iGXd24jiTACJy4YCiYpJ6IiHfAOJtsz7iNbH4oilzgCJdtH/iNZC7IiSbwWJBUAAiSy574hbp/iIKjnxiDJk74iTIgaJ6vv9iKge84iQKvuIKND5iL1G84jnxAOJOZMAiWzUAonbK/mI+gr9iPQT9Ihd6faIpjn4iJQODIl9YviIgUcBiVLa8ogk5/WIfI71iFJd+AjblfqItcwAidDo/YjIlf+IR6b5iLL77QhCFwcJ27oBiQADA4nevv+IQhL/iHpM6Agy1vMIdlsAiaez84ioePsIPuDwiA0W7wjRIPUIFbr9iPII2YiQovwIkULsiBJUAgk/KvEIBmn4iHFfx4hXNf4IhaAAiXcH+gjHNPgIBJQBCe3E+Igu3v+IMrUBCe7D9AhGaQEJmXP2CDae9wiCafqIAMr/CKmh2QhVqvYIfnf+iNrS+QgTYvyIBKEFCQ7Q1QhUevgIJLg0vKt4VbuRUAS8FZcduyCRDrxz5Nm75UscvEKRxbs3AbW74jLeO2FB2rvK20S7v8Q3vBeIVrrIulw6IAFGO6D2ELv++gy72cbqu0b2dTpJGwS8FUx8O4uZhjo9WCK7uy5Nu7kGgjtHYJw6RUhqOzS4YzuMmfY6LwdgvHg21zp5uiy7iGkqPDBRlzscArc68yEQvLvg/7lZDbW7xKIouy/f/Dt5oMa7QtFXvI5PF7sFrKg7ouYJOwQfCjxOwhG6",
        "XKFMvHS4VTvPO966+lqpu+XmcDsul7G6bc/du954ZzyrtIE6ctQFvIYjHjv2Ugy8PtRgvL5LoTtDk6863tGMOk6kPDtKjke8UXlivEws8TtOdUq8/BwXvPZPjTuksRG8D+FJur7BsDp0WSe8BSMEvFc6ADoOqlK8V5MQvLThZzmSU5M7hBldu6/FgjvBq0K8vNo0vMLAt7suFKo8Y+FjPIJXMrrDMZW8vubGul/2Ijw/39M8grMQPefoS7yvjsu8kAqEOmFTJzxU9po8Z+uYPKw8N7zmTem88ZqEPFL7EDuSN6Y7tSlnvPwdLzyHFoi8q8KOPGVqlzhC6lQ8vg4DO9jd/jzqRSu8WVovulS4NzsJpwc9vCq+PFRxjjxTW0s8+3hovJ11I7xcvXg8a1hGPHGtN7xkL9o8GMZJPD6nm7yMm6Y70gmsu85nKLyFeak8K2OLPIjoBrxxzIG6nYRduxLd6jxOYpE7p2KIuwwgzjxWSDg8tUITPNCnLzxKcmK7NLt/Owxa1TxQdrE7i3yJu14yBjw2L4c8W5HDuqo/BDvWsHy7GWaMvHwqgDqEGOA8N/QzvPeSyrwReaa8z6UwvN6Cyjs9s787tej0OwDPibwE4C+8ZBJGuyqguToDkP+7cFSHO4zc/Dub3Iq8f30xvCShTLwBtZ+7DEfaunukKLyYiui8OhZ7vD8TXbzOIwG8hPrMO9fjGTtTepE78HWGu0IpOLuMwjg7zj/wOwnGijpRDf86jSpuu14k5jjcCmc7Xzr1Oyh9ZrhYwC07cTGmu9eLTTsaAYA7uY/3O7lGFLp2nFI6ZLQNu1cjwzulkIg7V5vWOwSYObo7XQo6kAcZuQrGCjxu/5Q728y9O2ttQzpBjsk6KbjnOhPFKDzYfb07t4SoO3poVTsOXzk7kDbeOlEfQDwB/Oc7y+AUO+8RtzudL2o74oTfucX1OjzJQQ48CAspO91m7DtNmEw7fZvAuqg1/zstGAs8Fl90OwVAjTsFbP06CuHPus9HpTvosus7",
        "o9/BO9T5UzulE3E56wWiuKtypjv7aPc74fOVO2JqXTrduSI8W95tugyBQzh+4PE7bCu1O+VBlbvpra48289ju0AA87tsodw7UuMLPHD2irsW0rM7cPS7Ob6sgLriHaA7ftUCPJIMhLgfb2W7WB1UOxSdpTulyfU7nbTGO/9XJTsqLA67pbBoOwu7Gzy6AU882/OmO+j/NDvV2hG8eT3VO13xjzy46DM8QIMKPJ7s9zt0Dau7XM82PMp9izzm2jc865DIOg+DIzypJCQ7ijcWPKMMcDvG9TA8AnTPu+Lxvzvqc7071v7cO9U1ezrJjd076a93u0YRtTvL51A8hZwYPCwiyTsSRaM6WhFYu2lcmTvd2kc8RABWO/KoHTxkSle7u4AbOwYidTsAx0Q85mpSugf8ZTzZcIm78hHtO1uAODtKl188bhpZOoJCVjxs2sE7geyvOgD+9DqZOQk8S2OjO5jdHTx5k3M80tmDugUv1DuTi6I7uUTOO1156Du5TSA87CrxO4LtJDx2zEc7QcsMPGEP2DntUIS64WoVPDYehzs8J5M7FCHQOxTSz7pW9Uu7MoWcO0JvSrtGPjs8m/nrOx29mTsCRpI6eujvOlxm8LpBVDc8Pj8ZPBPBPTyDYwI8soxCO8zGyLmaxk87lF49PJUyU7gdPLi73vJ0OswEFjvIpMA66ujRO9hnuTpikk27dLFFuz8L5jppywe7sXBkPEEbHTvaw5i6BnY8u8STGTvJkTc7yiu0Oxty3zpbIhe6l++wu4flMDslTiw65WpIOwLfmzgufHm37O8ruuOo2DopY986SZhSPIHbDTqKKWk5oqLUOezlNDkErIU6aJxUPETYpDr2L4a6azc4ux9oGzuPNTY7Tm4YPAM1+jmEeUO7nT8fu7lr7Du6hgc86pZDPG1Ma7prDoe7tDhtuAT3KzyFXY47u+ITPDFKTro0WAi7l5kGu8IbUDyeZeQ5Ob21O0W89zlmDFS6bdY/O+lHCDz2OzM6CZFeu/9HkjsjQUU6",
        "Y+pUuuLjsTvGlQW7EY6OuwXSGDzhBqW6TKawuC9H6DrKJQa74RnSt4hcSDzBMdK7qWf1u2xmIztiEN+5V7gXPA59ODzcAOy7sMquuziodTsH1w07XN2kO9lbojskNdC7/NKjue509TuWIP47/1RvOwTBwzlzpY270qgkunKr0zvXyfI7nFCgu+PSHDq1mhK8VSWwuzpn1jsMHkg88Ceruqt2T7vSnhS87DM7u4jM7juKSj08s/R2PDCrO7wg1sK7iBBSO+pqpDtRzig8HCqtPEnZOLzn7Oe60lcEPKgyb7qG9tW6zKrkO7zZyLvGDTW7ggIBPHjMgTuWNBO7KjOOO2gYSTxuSFy7vLR9PBVOhDyj+U48BZnaO7izoDxRj4s8S5aTu0QpOTqBmbM8XkDFuhUlejorHZk8TnXGu8JgUbzUOPw7a7nCOijVb7yrLic8+levPOpZP7shV0E8YsSRO14eTDu6Sbo8jUNMPEbmnjsAGJo84WIFO/rvETlMs4o8Jj+Zu+3kgzyjywA8m0RtPEt6nroqy6C7HtpqO31zajy9N1C8vZ5iO4FOAjx64u07hyuDO2b2RjvIjz47fscWOxLGVjoAZ5U7/0yBOwJXWDtV2Es7808lO6J+xjoPB587AJmGO2M9ZzsbGEo7xUonO0IfCztkP6s7LW+MOzZtXTvGCTs7S3cNOzBrOjuFGLM703iNO7LHUDv2Yiw7bKQIO7QcVDvVH7M7yFObO+zESjvV/fs6ZJQaO9c9Zjth6bI7xe+3OzmOFjujcVU6kbzBOkJPljs77bM7gCS0O6U3mTpgEmq5Kd4yOvtPwTtxxqU7jt6QO6tphTo0HSy5fgy9Oo+jxjtIZZc7YDxgO/4ZrToHN7o62q8cO2GZnDsHipM7iTUiO9LtdDqnEyk7PUccO6LsUTtp5HU7ugq2Oj9XvzrtZTg7tqInO7gwIjutsEY7OgFdOuKxPjscITc7pZdOO5H/LjtR9zE7beAHO5QIeTtRWVM7+28kO6QpGDuV9Rw7",
        "vGSGO+3mqDsHVms7MMf6OovP2DpRNRE7GOuqO4ah7DuhVI07MOktOg2SHjtHw3M7K6+qO81dxTulxBc8zpgpuweEuDpn8NE7e6GPOwaDOzspuC88nR4suz5qtzqFs+s7Nb+JO2s7Pzsbqag7a0nrOqRWuDuIJnU741STO06gnjuEB9s7uvRAO6U8BzyBnq06AsdzO845jDv8VRk8Kzv0Os69Bzw1bE07mFFIO6TcJztTuPA7hF5HO54FyztT0uw7NoyIOwpAajtnr6A7MpuvO8B23ju4aQQ89wyVO/vqlzuyZSg7IqvuO+BSDDz4uNk79xdrO77bpjvdN78634MPPMek1zs8hKc7BO5XO5lrmTt2rno7EHnIO9l4nDtmGKQ7JSyjO/9UgztP/MY7mTiIO2sIvDsQL787ToltO2rdZjsC8Pk7tppvOwKF/Dvk6Kw7YTv9OjfHWDtKKAI8j3BOO7/6AzywXoY7jFVYOma4JztnRvg7Wbx5O5fO3DtXMIE73g/VCM81HQkhbHIJfboKCA76H4mbmO4I9/QziMAaRIhEAouGyIJCCe3FA4nMpJkIxbZzCHXeSAn7MQcJ4gRACdNANojDxOQIjBamCGw0rIeNrIKIXlpziCsSF4n/Bm+IyhHAiORfowcli9kI9IEliX/NJIm8bZGIJDc9CONc54i5i8wIjeP0iMnn44iJUSGJ2aT8iEfZoQi69JKI+UWGiJjOoIeTk+cIxKiMCHNFGwn2zBKJV/0ICVbWEwm+4EyIsTUgCZ4SC4lsILAGAni9iCfmEwnmAusImznpCKfIMAnGaSkIrBI5huV/rAhV+rEIrzeHiNjq5wgtiYUIj8opCWD3a4jCXjcIRIHSiMWa8wjdv98It74GiRJdPAmOUwcJpMEyCVvwAIlBpm0JJIz7iGebvghl/icImMehBRZtDAj3RzYINBUZCfjmoQig55gIwIazBcHmjoiM6MEH5indiLj4kwZsUOgIMt/nCIL1dIj8WUqJagw+iLVUHAkUnmwJ",
        "2aHMCLGPZYgtqFAJuHkiCKmVkgiQCy6GHNwVCXNugojX6SMJgD6mCHQ58Ag+eBwJiasQCRd84ogxQRMJN37/CLVfdgh6d08JsFb+iAcvJwmvkRwIPMLSh7Nbbwk8rrYHnX8BiXDi/Adya7IIVUDlCHBW9AXrpRoJDkTNBiXLcgn6AuSIqiykiNuLhQitFTGJBALfCEfxlwiBi1EJngBVCTzDCQmFiwCI8VATCeXKTYkLmhQJE2P/h/Bgk4jVbgaJrfjWCHXw3AhMFjiI/1yCCDbebokQlxcIwsWoCJocBgmkk7gIacciiSp5pgg59k0JIU2aiNCMS4ju4U8Ia5lFCRW7AAlyARAJAk3rB/LCtwjEGBIJxbSriCCqVokejnKJH5MtibcqawnG4ziIuX6jCCf/QQf8h28Jpvavh5R4owdyfO4IPU4ECW4HjQj56Q2IQWqOOy2ofDrNq5M7UR0MO0Wm7juNIPs7yDQtO9/1jDt70847qxQgO6vm/Du9cyo8xt71uLzOCzyUPA084WE5O5UGpjvqjF48jTUHuy8g9TtUExk8MoGMOICK6zp4/VY80l6Bu+grZTs9FwA8yZ73usp1hTm26CY8G1Vmu347RjpXvwg8A/6vui6Wi7pQ6Oo7KX7qttjykzj5z8I7sr/hOv7JMLtcA5s7eaIkOxqrHDvEkN07kqrWO/km07oeh7k7pYUuO7Wokzsev+c7MEQMPBbLhjry89I7dw09OwkPtjtq7x48XxrbO2AnOTqAm7o7fLg5OzOBETwC6008EsfCO7yNsbru4T07RSSvO57WWjxmRz88gp+HO3+LDLpws107K54GPFQKUzxhhU48bsYZO8ciRDvDl0A7uywNPKIzsjtJIEQ8EykiO3gNnzujPaq6+4z1O/wjVDtAX1E8jZlLO29VxDtcao+73cDUOzqXzjvMzWU8/EBsO9p+lDvGEFu7nxlsOx+7ADw8n0s8QA8IO0keSDoSe4S7XbfaOdDdBTygWcG5usvDurDfrjvtSuC7",
        "HRcvO//UODxVkEW7hLuxOiPtETz+/6275jYAPHRAMTzKbL07A+vrO8xHRjqK4uy6RwrRO5DxlzqWYzg8D1OrO7uQBbxTbsa6Bc4lPF5VmbsgoVw7amimuYkQq7sVu764X65zPGtmnzv7sXG7vPaBO8xwKTw210U7W7OXOy2AgjwaQ587aAC4O47/KzzQlgI8jtPKu9p48zvZvVo8PNt8OzFqhjkB1NM7S7pIuxTNCbsENU077TkZPJsrLTut9hM8hbYhPJB2Arsl0rA7C6IPPInbCTy1Gqo8+44+PBVQKjtV1kE8yuaVOyF0ZjvmlZw8TqnqO4eaETyjrMU7qwSFOwf/PjttPIY7cGG/O6vSPDxv5oa5r5CgOyU8sTs/Y0E6KXA+iXksSIkcQ/SHZLltCc+1nQg+X/YHN7AmifHtBInrbBAIagpxCVIk1ggfqXsISgtHCSt3HYkqVXOIncrviKz3W4dqPFMJbNxxCA6XXImyJMkHvTK/iNpPDgmbgjKJYL+PiAneKAkiutcI0qahCHpM5YjmvRMJ3LbdiFqryYg4wHYH5dsWid3d1oisz1aIFcgNiaH+agliBCkITcKTCJ+6PgnGvr8IQaaGh9VzCgnXAB0JdP/fCDUvCAg1SpMI4v83CTzgiog2jBiHsgMeCVRr8Aj5HugIa9/liOCCZAgni0uJ0ZA0id2T1IgqIyMJcfXoCF1RA4kaHbKI35sDCRNfbAnXJgAJq6DkCODxbol9BGgJZEHEiOkaaQm8o+MIOI79CEsXCQh58DOJQSCaCO4f1AgcuL8I1IZfCFRay4j+T7iIEDMrCYpRGgnmauUI/B7zCEAUG4jKTQYJfJeTiDry3whlHMMIoLSriLDk6QiEZz6JlkUKiIUaBok+3NWIZr+2CIAAnwjnIOoIbbyCiCRRFgnyfAkHWd3+iPhzZQcQ1GYJZsz3h37t1YiDtyEJVGTliDuQrQiPlQUJUPgzhjktYQm/eemI2rcsiLPEBAnMLk4IfpZvCZp2xwj+zu8H",
        "G95iB0/MDAmGQK4IQikMCdfjjQgE9peI0rUkCbwFEQmJa4UI0INzCKq93YhUoDMJ/Ja5CIueCwm5GAkJBrUoCBlwDolqnhmIriIgCb8oEQl2txOJPGQqCFbVrAheQg2JoXoWCQSWJgkJE7IIBTHjiKm00wj2luwIVSVtieGiLwjeHAOJOY7nCNKin4aQ5xUJAkBdCNsZtwjPuzAJwo4eiB01CAmXQb0IpT9LiUC1jYRK7FuIW+wWiFELD4lOHHSIpCfCCNQNzYiUoSuJQINBiFkd1wihEkAJSZVcCQOfvQiDLisJPhvch2hQcIlU5pMI"
      ]
    },
    "conv1d_2": {
      "bias": [
        "V7UHvGUbkrw25R+7ZMOeu/pYEbt0K+Q7w4vuu06lWz0wora72/8gvKaXKTs="
      ],
      "weights": [
        "YgHDukU6t7vxjy47LRgpu+P/IzzJa6s7Y7KvupcBErx2HLw7pN0nPHHZizrUWw48VoUsPAtk4bvRZp66sK1BPALHzLs+rHg8O5U3PF7OELvrI9g75pY6u8ufvLvGNxs8P7WOu+G1njt19BQ8lDL2u8Y7v7rtx+67kQ5BvK0KQTx2CWI7pe/uO4w6EbvASCq8qEW1ux4hhjyWDm87INnbO9J5FLq6Wng7urFnui94MjxPq1w7Avr2u1u7PDlBxFk89JRdukJxmrraxOG7fHqGvEKD67sRhxk6OMOfO37YS7u5Nza8C+mhvN6fWby10WK8Cz8IiV9WAwn51wAJQJMUCcVfBonoOAeJxmICicLoC4mokgmJtWgJCeQaEYlBhAsJvKUDiZgtCokRrgiJxgkAibABConX7ASJDasQib0sCAkpug6JG9sCidz0AImnNgmJs18KiQo5CgkBSgUJUYQJiQUSC4mBnA6JLpoNiWVuCokQzwsJnMsUifkvCIkPkQyJrDkGiVH4EQnJRgUJdmAOiUKtBomOmASJOQQNCcZLCIk1gQUJrQgEifpcBonA0QeJwoMNiehmCgmpigUJ2IsECeZsDgm/0waJs9EDCYA4DokAZwaJCqoRiZ5tDgkf8A6JWeTGuxGCVTzgTey3zsL1OzYJ8bspWGQ8Y3QxvIeVubt3P/o7vFspvEkud7zUVbA8NreoO+HUgLws8IM8nwGqvP0nTLvSfGk62bb7O6bcKLz1Juw7PQ1vvPnzkTss6l28UIigOgrJLrxVeSC8kWlEvJIFOLs6TKG837WYO0RqNLxvzFC8fO0zOWFLBTwEXgS8FUs1O6Jo17u1wcW7mueLOj2b5jzkwjI8F9QDvIaJwrsDkOi7f4HNPI1y8zyHIKE8PsANu78dDLxjXdi6jEugPDKxProcw1a8HCrtOyHTAjzDR5K7UBCrPM5Oq7y+6fi8iCiou+HyCDypGoQ8/LcCPCZjj7w01MQ6+y4GPMV8RDxANYQ7a4SQO0QvNbz4ika7",
        "0CV1PNQE3DtWpay7r6Xbut/FAzwO2di79leYO5frhjqa0EG8HYnQOrEVrTyhzmy8rflBOumemjss1j+8Q64cPG8jmTyGdmO8hTeKO08M2zqH8Q68NSnKO2Rb+bvUc/a7XInpOyucmLzSaou8U/oWu759wrz68pG6xwUvPMathLzhrQ68pm/HOO7ZizuoYYM7UVH9u9j6tzuFJos81hADPJwDnjw5p4o76R+WvIGtsDw4tII8URKaPN1XFTyIGco7IvcKCdIU6Ahn+z8JRQtZCaQ2QgmqbLMILbxkiMI1zgieajgIzMeSCFP4aok1CT2Il2w2CaOO/QiBxm2IXRNjCBHcPwk+ZwgJGWcCCa+5uwiZn0sJ1zA4B7IfoYj2H1mJ5yaTCCg8jgic/MuI545ICTGXrgjnQsmI5/jOCNkkTojgcLEFY0+ziHNOJQmixm0JPepqCRBszAiHIUAJuWjGiE/PhwhlTu4IAIxoifrGGIinVgGJEMpciJ2cJAnul7cI3ikECdfLYImEWUmIx1IWiFEjJ4nUEX+I12a2CKO8TYe/K6+ILhU6ibejUIlGZKiIJykTvUa2LTwXfdw85FekPIkLibwBMOU7x9lrPJESHj29foo7FTGcO0QuKLzRc4I8LlDgPLj7XTsK8Yg7crBBvEiHtDvJ8Sw7hloQvCVaxbvkiiu7k1vPvLDQ/jwA6zS8phQMO5d407tQANM8zllEvCPNRzwAk868kEPIuhQTSzozm7i89bBJvFePmrxNRcQ7029fvEF7Z7tOD0e8gD+KvEtiyrxI+LA7URRSvJtLhzvVBpW8vhb0vJlJUDxWBNa8f7tRvF4nSTyckI+6+se6u7BnFLybnY26XA2xO2XEkjzvbNU8zCbbPPYTX7quKkk97XzFiB6T4AiEx+0IfGTaCPtd7Ah6poCI3+npCIaa+Yhf6ygHt6/vCPSg6QgVReIIBbTWCBs16YjxmNeIyNyViLNh9wiugZ2IeGP0iMh63Ai6U/GIjF1+iBAi/wiFDtmI",
        "gDrwiOL+qIhvIP6IpfFEiDrH9QhNMvkId94bCWSI0YgFvPUIi2MKCYb2OYdTBvOIZqMaCDoE9ogeNuqIZMO5hko10QjVIa2IDpv6CDJz7Yh3CyUJ/zD5CDEh7Qi2MPQIQfXdCNb86ghEc/KIB5btiDuAAogeju4IXZi5iJxc54jEM9CIKDPwCMzKXYjFqvyIOQMBPJb00rtlAmI8PQoLvK5TPTviN1U7G8yOO5OiCbsmqK877au/u0zCpzvpG9S6HEweuggEibhdr8O7o6/WOVCuvzsZdhW789DwuSob2jnOiTG7osW/O5C7Fjwppjw7vQeIuzaxqbhxATI7g4snPH9VMDwLzQw8oxCYu+Owyzr/YcE6QxVKPLi/IDu8DfM7OM3+O29Dpjt8VIQ6yYZxPI86ALzmIai7L2NdPICKFDyjVoU6dc05PNVOF7xeSh68vF3OO062ojuXBos7hm4TPBMeGzq0ngu75vaXOSSu07k8igE8uDz5O5XfNjxrwgM8fsg2PCYMgDx01Yq8y1EDvMIr6Lw4uJ45kx7BulpdAjzFKfK6JOEwPZTpBb3kF4q8u9MGPdy4jjx1Wfe8BRnAPGy9nLyWHBE8Ol4OPJDbojwIU9Y8fCZdPR81KLnbZBm8pj6yPPkrrTyh+hK8BH3XPM4ebzz0E0G6piZEO/BPRLydeiG98pMVvZt8AzwCfdC8oC+ePIYOBT3DLqq8aZTVvCyck7nIBwk87TVVPPOWKzuREs68k2biurCSpDs2/Yk8dN0lvOVKEDxZ3xe8M+rfu+bZ6Trg8488BC43PARNtzzbtcq8Rs4FvJFDDTzYKD476H1FPZH7DD22LAm92xSGPKY5Mz0LaWM84OlkO6Og+7ziItY94vujPPo56zyVVyA95rNDvWonMLyBp509l3sXPF9VHb3ioBU8/UesPCjNIb0YVK47MegFvYeJfLqWeVU72aqXPPb7/7ygCxI9BflROUBGJDu2/ui7FOyKvHmfNbw6Cbs8o4ftvPaV3ju0Ydq6",
        "KKWHvUTxCT1gDV69PTkgPR6707sVrWS8eUQOO90qMr0Tfda8fwcCvSSprzzMbUI9TlGxOgg5pryZI6y7Zm7TvB0zUDyoW5Y7XGATvTTFETx0Eke99PXTvBfhzbuQxjU8Yom6PPFKhLylQIk9Oa4OPefaDjw57bQ8GMLJvDvAvrzWuss8Efl6PDcWELyk6Y48qNkxPECqFL2KV6a82D8LvVo79TxcEEM9xiuMPESF67z1BNc8ok2xu18aXD2bQhW9mnETPLdJjLx96ws950zRvJbK0TyDSa07P3ZLPAznbj1FHvY8nGpXu3tZnzpqy7O834MXvFmTnjsahAW9r86HvR6SyziGDA49WcmpvFZBAbxuc4K8YQNVvQS7EDzRPtW8dxPVPE6k3jsgHUq9cdisvGJsizsnngE8sRI7vERCwTxlGH69nUVCPCiO6bwLc867"
      ]
    },
    "conv1d_3": {
      "bias": [
        "axSWPHQrHrxWt4+7Gte9PHkt2TsjsR08UwHNPMrCHrs6HaQ9rGAJPFkjCbw="
      ],
      "weights": [
        "CYjjOYQ2QrzpsyC8BRpHu3mLLbucf1Q4LLWAOgFHBLyQDIA7Xh6Cu1hUYrx9Pws5HEZpu1h1GTvnAkw8XQgOO4zzurttdRa7CAzvu4HvtDvOFVY8QCmQOoZXoDsiKry7NMBkvARb9jvc27i8MAMavemVYzuufoa819HCOmPna7xli5C7j6uWvFjrXDxbmw29VpYsPbhm2jrwkzE9uE7+O5BChzy/hpg8k6GJPErcNr3VfsY6vroIPYrjjb1rXpY9Wd8QO1XMiDqKknG751uwOtsWjztX1Uk72AJ8O3LmXDsmkDi7NlceunlUszvhvp47IOv6OkK+jDtiTBm7TvfyuoIgMDuNjBA4ikiMO0XdgzvCOWe7PxvvOiu1MjtHgYa74+eFParLMLzVF748neEFvVmb1Txwejq8jMEdO4Td4TsQh3Q8MpgdvE2XYz2Y0t88t37xvPGHyjstbIE9B2+fO2XJubz+qqo89y6DPIKnbDsvt2Y8ywigvBseA702F26806NCvH2gzrv5HQA9IrXTu7RDkDqZ+Lg7J00GvIJ+l7zP79o8szYIO5HKPryVwjc7f0KNPO7u9buY2a486zKDu3XsDrzEf4Y8/IkvOyHRvDum5+Y8ECi4O0TfFDwIuFk8ft0hPKqyZD1ZBng9gd6YPAoj7jwZu9S7t24SPVzfrTw5zz09NtLFvLKh5TtJg4I9XHuovO96V7x7jBw98FWEvGQ44bxbIpG8ygCcuxYf07tfZtK8K4u7vLA1M7wDXO87OapnPTkwwj10S5g8lFNnvAR9Cb1fW6U93pEqvD1BLbxKmRC9m/bTvI+X5DxF8g+9r1R1vRqAX7wK7Ua9f9vRvKlsQT1omMw8s4qCPJiw5TyPKXg8bSyEujo+Zz3wiNC8JhaDPHFMkTwlQRo8+BqjOpK+Yjvjm5I8TnI7Ok0BkDtYupo86ZaxutriU7unXHk8Zn4/vHLbcbuRRCA8mTd5O4LrYLrQUxA82UaaOl7s2bpFl4Y7IwQRPPmHXDxt96U8",
        "W+foOpJB8bptMaY71lHLuShdsDvS+Y87pNrFOSxZdrrLO1U7jKSAO1zHPzyUtxE7HBKgunYpBTvyCjo7yU2QO4XHADyhyrY72WuFOuyFPTta7746Q+ixO305VTp5egs8eHLCO/QAGLo+LNm8GsnqPIYdAbwZ/Eq8gix5O4NxaLwlpQe9oEarO35fLzzEaHw8lABku+MUnbxSBa28HMMdu7saiDwepb08DK1zO30g17q9EXW8ANaXPAAlxDo0GRU8go6MuxoJjLvrdIU8eGSVOu50+zoXQzY7eA0GuvRlNTzcITa8aFElO2Hzw7xpcYu8i3cYPFJiGbuTGNG8nz4UPZKwbrk0axa8Wg/NPNy9ezyvnzI8ntjYPMG+kzw2f+C7"
      ]
    },
    "conv1d_4": {
      "bias": [
        "eRs/Pcuszrs8TWm8A6epPIXoBDzeDTg9kZY1u8KvY7xpS1c9wdahPQsv8js="
      ],
      "weights": [
        "d9yJvByknbxKdlq7V5ZGOwcCVzzfF5s8sSb8iAVgM4mVms4Ijv+cCGe87Yi89v+IhWIwvP9CtTwznOw7qAUvPNPCjrroM8C7oWNdOzu6ObsG7+w6JDuEuu7l7Lnmy7Q5fpogPH8ALT23D8+8vfsSvKkNlrz+8Km8E+/8OqTM07lZwvo7gxxNO3Yx/rrCK487klkAieoI8Ih2zuOIIev/CGq+MwkKxv+ILUasCH2FAIlBzveI3vzUiJH4+4jT5wAJ4q2SvLd9k7zn8zK91gzNu7R/rLtITvq8LnjgOm5IbLtS0Ac7oIb3uiV6OrsDV+c6xWE4PUS06TxFWvY9We6OvM45grwKLpQ9"
      ]
    },
    "dense_1": {
      "bias": [
        "sUyCPQAAAAAG6VQ8ybLRPFMyJzzs55s9NDXsPMF/+rzIBoE83d69u6F15jl7SaA86rRFO5Azaz24vJQ8l7MXPQAAAAAh6BA98b/QOP4YYjw="
      ],
      "weights": [
        "FVisPnjPhT5WAXc94AWZPjjqcDyUPUM+ElxnPtqYLD4c5xy+W9uPPbRhOb4wW0u9VqiHPjlJnD0IqqK+C04HPLjkAL2VcaC+EU2YvuKyTL3bktw+ygBavuqOYz5OdcM8Ol8VPrjn0D6OCWK+1hM1voCKpT0FLhw+2MHNvWa2Bb7TdxU9qy1iPgThXz5Ypbw+tAuJPhTOFb66Q2i+p72PvtLEqbzQl8I9FYGFPm0wLz6lU4a+b9n9vvfLv74aLQO8+5+3vTuBer1Nd4E+0d0hPsQ7Hbzkhpc+ZW/NvmW4Ir7+PIK+8YoQv4yEBr5gg+27kZ1YvqQJbb3WXf27JxgKvhwUA713OAM+T4iwvXuk9D1m/di6kIAAPrxOsL0U4Uo+pYDaPB8stjz+c16+uLpSPMYDZr7TV5M+GNI/va4Okj7rB4G9ImhQvtTNUj56K2a+3bolPlGGUz0RDOE+h9XrO/jB7b2BFj88HH8RvtrEpb5SokW+ypZougClnj73Vdk+mCBivd6iAj+IMom+SViWvg7rjj7aism9NNkQPi4gmz7Yepg+reo0PhW/fT5bR2w+zsHMutpINb5fism94M+fPQC5JD54lQC7BI44PubUPT0EzpG9mZkpvl8Uw73ZGzU+4vjuPSqS8b1h94e+Shj7u6d9oj4Ki6k+f4OAvZ61Tj3JyJ89VaRqvnsC+zx1byA8MgEQPpMbGL55ZzY+VXv9PYjwIL2xKpM9kWx6vstkMb7NxyW+WcQmvvB08LzMHJw9Tdymveojwz5iNmU+gfrYPQjoVz6/t6K89zNmvv+pw72Hi5E9fxy8PofFBT7ut6c+KBM8vaYoX74eA1++RW1IPt72H70A+BU8UatSvlTEkr5YZi4+z7xnPaCzqb2HNbg9kjtrvhADGj2AK7m7SWkAvbt1Mz5QIHU9SvxYPZA3070434s90wE6vgwSDL665tO8D4+fvICF/ry0ugC9g2KEvSO+fb6i6BI+n7eIPpR2pr6ubTc+cCNnPj/UW71tmD4+",
        "OxDaPWS06D0m8B4+UR/RPT6Gzr0BJqQ+OTQEPrf4cj4Cthu+Jv5FvoK4rb0R5ba8Eh4VPpNeor1hhzo+cNIovqryMz4QWaM8Tr5qvkv1z7zir/k7N0gNvn0RVr4+U0i+8HuVPYxBZT4mrv29ctl8PpdIlL6Ah1G8O5RGPt4G+r3wVSK++D5lvgl6M73PDdQ9AJCuPnWyHz2w2P09ZIUIP9K/+jxgGkM+dzbuvYbATr7KjDa+D+6JPqdjir7V3sK+HVAaPSBZfjxEM3Q89HQTvp+xh753hGA+93RTvjHbCT5TmIq+j3siPfn8yL0KQ9U8S8OKPslxqb2KGMq76WtXviAhnLzaix2+NL+5vbbClT5Zack+uMkOPX9p+D1riOI8wcBPvoC5lr4kWxG+qlR4PppfUz2n9YU+2411PmdehD6lyK4+gVMvPiT1SL4FiS++/E+WPsnmfb7mbbo8dXsJPrBcZb6RARC+1tdcvi+zp74GgbO920LOPoBeyT4o+QE8gM6OPThJQ77EZ2W+v+uPPWm+GT48QKU+GizGPQHOxr3okmk9u3SWPrO5Yr5ohcu+nC00vlE9Wb68ADU+TfRdvvPA5L0FZCW+6dAvvt++mT12Fwg+oFE9PRZcmT64O2G+5JeDPqXq7Ds70Ry+1MeXvuM5jr5IQ+I9Oq+BPvoZXb7yRWk9QPGUPurn371XzVi9+mB9PhESwj68qMc+Ga+PPbNPrT5yRq29N3qNvsxPf7ysIZS+n5xgvU5IoT1ETzS+hIkcvot30j0cChS+Dnmqvrdxkb3q6B8+4PB9Pvhcj75+4ZY+EMlovnkcRj5nGBc+/+76vRK+kr6U52W+f8Y/PsMrkr4MFio9Ahh7vvd3CD6A96Y7capzvludLb6TSRE+RzmQPhD2MD5m2IO+zu7dPQ6uIz4tqgM+smQivkfFDr2jGgm+hDORvn0huT2RlYs9pzwxPkesN7vbr489ssc+PfHTgL4zxOy9vGtcPqQGBj5jLVK+2MQNvquDi71rJ7A+",
        "GqCAOyurgr576ok9oJtSPvLFq77SCIq++c8wvXJVQz5GZks+csWwPrf9eT2Q5oa+n8JivgWgNb5YZ/e9JpG8PtHUPb5yiR8+TmRVvY2p0r51zPQ+MiVNvR3n8z2/+y0+OkaiPjeuZbyiWby9SBiJvYamrb5P6SE+6r2uPgXp4j34hhE+nbA5PeOtq7wq1Xa+g+uIvnNZA75Xb/U9SNH3voY/Ez4qK3u90CtkvQZDQz62naI+d0OhPCeLXr5TCOk+iaSYvnmCjD2X8D8+1apwvTznlz5C5rk+GMTsvW6Vt77oltE9s4qQvmr7Qr6E/hW9nOBTvXCDDj60VYS+N4qgPWOwH71DiHi+JqcmPSPLiD4hEUC+dr2KPpFRubytxkY+4C9aPhxlKz6PFFc+I/ssvkBusbvkgj2++PU8Pnkxvr7y1/4+86O/Pr9L7z0KUEM9t8i7PrFefb5jQVm+i0q0u3/kwr6ZL409d3emPZcxqj4sdlM+iSeSPRNXXD4Sk/S+8UbkPSD8YL0k8jU+WBMJPuny7r3UlFW+LLMXvjlAhb5PoVS9DuvnvRkRBz4xaQG+bioSPli6Tb4liR0+wrJ/PtYTdL6KsK49x4iIPWoNnD3zo4Q9MI6bvQK/hLyTCoi+ijTlPMdTCD5KeVM+NZ5aPJ/PEb7Nny2+3eyTvrk0BD6IXIe9n+epPq+alD42e5Q+Aglkvv75Xz7B5xg+FQexvoyaPD6YGhk+H9Q/PnRvlz0EfJ29x8kovYhFEr1GsZC+jfYzPmGzlL53TzI+VWRnPlgio76lq1a+iECkPcbRgz4w5y0+ZZkrPmuAnL1chIG+Xf3yverWzb1wJpg9ygl+vqA1YD7x8Lk84LJsPn81A73ThoO9IohgPnMKkT4of64+tEVwvmXTDT6c330+xwNiPlLdHb4QfzY+eNbBvesGRz70vIY+Uv2pvYDI2b3VzaG+2c2HPjAriz7BmCM8fyimvZdFE77XBsU9XcBdPmM86r29c02+Cy+gPvkFWj0AwRS+",
        "CkZ0vtFEyj4zzlO+fyiavoDnl723K4O+hTrovV0nUby0QmY+1R5ePmqJqL0GAKi+EcJEPoLx3bx880y+Du9KPmGQyj2Mg46+xRGGPutfWr6AIei7Tl4mvuk6er5DVw4+0pWvPkD1Sz3GxgK+5Ak+vnOvZT4ouZA7pJZ5PkneiryLFni+l02KPjHAYb4zawG+HkBQPnZqAT5VVr89X5CVPur+Z76RZb29KkqKvqFFUT7E01G9OOrpPQtsFj5bcrk9zkvRvtoLk74Ya8m+170HP7U/gTuNFkU+sBNZPlLGzT7ksjC8HYisPnjnjL7qXXS+MMMwvTbby72yAee9zkC5PgLzE73AXai7DJYTvlJqnj5PktA8GWYTvDqArL0c6U4+qwfOvUoiaD697Ak+6DaJPbmgBT4hsro9gOZPPlsZmr6EC3K9HZoVvKE9Kz7CNck9/aiNvYQw5j1QHqy8blD0vbmArj0CF0A+u7WfPsQBer4Xuh++Nm0+vnKESj4W0oe+sKtYvSshTz66pl0990yIPuB3G74cQYo+XwTPPYEaaL64Cp+9UADhvXh3oT23/36+8wSVPJgbOb72Tym9oPZevmDnP76x2ga+4FDjvK/nAr6EySA+Ez35vBbIgb5GlQI90L3dPM/QzT1Aqvc8Xq/xvfP8Ab9odV++iKfTvdCBKD5DTak+zH8BvxKO9b7395o+5CZDvoyJSr4e9wC+LIUiP226u76WQe89QU7Evehx1z1PuwO+t66iO0z4J73+W82+cjSgvXr6hD5DPjY+MRMRPra/Fj67s6o9zaiFvhwwTL3JMwm+6UUsvQvAXbzuifa9bDluPd5fGDx9uJK9tMerPgBbFjvX00o+/9AXPfi6yj27/S6+94STvjzcfL7zBra9ulB0vj3RMr6x6+q+vF7wPn2Ow75frni+KB+MPjKzhD4jbpg9k/P9PoVJ271kVUm+fjmrvRgfsz1hkjq+X2p3PowiAD4w8D+9dZxivi3lbr4GIkE+5KydPQyhyr3X038+",
        "tI/XPUvkib1xh8Y9bux4PAZ7gz45aYk+IyNFPorn4L06qZy9eg8svg3GYj7EiG0+ieHJvRBjXT6i0JU+2O3bPXkSFr6VmOm9ayzNvVJYFD4N6/K7qIcePUa9Bj4pvB2+meFyvliF+j0nKQ07OgJ+vq6z5b0pnsy9qmlcvtaPRb0KNic+TotevlDpWz5MI5M+uweSu5Gojb5Elig+0etmPpAW6D2YLcU96J8jvTLOCz2mE0Y8UiRBvYN5pb05Wgu7eLSMvuNotr2QxFk+aNuHvQuRKr7Cuwk+obypvZFqlj7HGuO+KH0Hvjql0r0pmBk/jbNFvUSXxj2UZwE+QiyNPtrWkT1pORY+o0Hzvro29L0Qrt89MAlMvm9CYD6RFq8+QxNKPuYAFT7+2Uq9lwhZPi6PWj46m5s9lWskvlf50D12+Ry+9WbgPEA89zzDQ1y+RSeRvqogJT47jfA977iTPnw2ST5t2Rs+tuSIPbeihD73WQg+BjCnvftNTT67saW+P8K8Pubvoj7HW+Q8u4WivW/uVz7nhI69xPXgvaerSbzoAKS+QvcpvbsYC74uzzk+jXsJvhfYMr7Lmk4+/lwhvXZgIL7o0EO9LrCfvhye5jy5+9K8FihJvl9jkD6mNRg+kwxSvZ3zd75EZKe9f59cPnX+wz2V4gs+WR2FvjE8nzxQ86g9ioUiPj1bYj6yMXs+uBRuPpr8zb1APkS9Xd7dPQSrWT4QByO+DYfOPbSxdz2E+hy+NokfvqJcgz7aqzI99QJ9vlQu0D1a8OE9kAL9PXA/XD1N1s49nvbxPUkEV74="
      ]
    },
    "dense_2": {
      "bias": [
        "aUU5vNPzGz3YpIC8Pj+4vL9dizwj7am7AAAAAKOplz0AAAAAGR3Qu0LiCj0HjUc7JjRTugAAAAAAIm28"
      ],
      "weights": [
        "qQC6PhJJFz4wiLu9sqfGvu4eFD6Mavq9FwS6vj/Kyj4RY7e+Ta9NvsGSez6zAcu+PRIUPgDmbTvg1sG+EqNTPoUkqz6APek7GSOjPm5yTL612q2+GXifPvxuUL66uyE+BkQjPpyz1L341Mu9doU8PpB7rL74IB09vdjJvgO8vT223LA+jSWwviJCsj5wiqy+pFEDvk+CmbzBKKA+I5EHvmbWUDx/Po8+9nKwPWyQo746wgU+xvD0PnthIb/MEE4+/Y/DPn3X9L6UMtI94f5BvsnWtr6VwMq+FnOXvgW3tT3weoE8xa2EvkjGkj0JMdi+BFW/vv/m2T5Bl0I+Keg9PhA9nT6YuOI9tiQUPhNOaLzwlba+egMgPd40Ob4+Tss98xTdPHKVaT6I6bo+qlPIPfT65z5T5Fu7PDmyPmlONb5X/zc+aJC+vumo3j7wf8q+9ymivq/euT5x6De+ADExvXBXnj202qM+IlbGu+pBUD4icNg9J9uzPiVLZL7+p2++FjzBvnvw772O226+hOVVvrCa4j7KC1Q+6Bt3vtJ5yL6TEcE+APX8vXn/mL7W2bW8JKk/vvPs375KGJA+6s8rPn++rL3dx7E+RskjPIA8w74Bb5a+VlBQvYvww77JWg6/uICEvuwgcL4f8Ji9GTT+voJ6Rr3fsMq+oGw3PSjbSTxcUe8955IFvqBt/T4Rr4q+ywhJvYJpyb6Nro4+8rcOvsPYn74a4zc+ntE0vndeP728Rd09SAqvvUGviD406J2+NyxuvRMwOT7vA8O+YJDhPZqaSj71HKw8gLrUvrcbz74hsEC+zmSrPS2XfL4+IWM+XFLCvtrkbD4GKIu+Q3ikPqMz6zyyocw+JWBwvgGrl75tNlA+gxydvjMP7Dz9qWY+maONvk4Co75tyCi+5kllPm5ThD2dUMA+TFgQPXzXkLxaFBC8L1eavRJGS74rkc++4Pv+Pst3Nz41zH49S47kvADazr29cYM+aCt+vb2oWj1lU72+QY0EvqZXlb6Xwh09",
        "eBTEvo3sX77ON7O+U+UpPsc6ijxCBca+tNm9vh0lKT5DHv89lj4Cvtopfz5FkTC+DSvOvsVsaT48uk89nJIKPsBQrj1IK9S+5buovjrw3r0FfH6+crg5vWVBjD4VFR0+IFxlvPidvT7MeJU9FeKLPh5ZET7bnhU+CGFjvHckTb4Zx6U+JxboPaht7D7UdiI+/BTAPWpBgz7qC9i+5g2rvn5lOr5RvMK+r4aePpjPgj4DNqG+dPKyvvjtd71q09a9qKe3vhXvzz4zGrw+xhUPPnRJbr4oEcy+YFutvZu4iD7QmvO9EBROvTlTsb4q76m+Q+miPrCDsTzYib+9d0yYveQwrT4lPcA7LutGvt2fxj7LpEI+sEBDvYeSSz5yH2c+XbSMPlOg9z3Tlaq+Jf0SvXj4mr2alr4+2s+WPsSaoT46FiO+EpgzPJ95VD4vKpQ+nhnOvs7yO73AAKi912SMvq+/O75YbCA9WB0DPeEOur7IFyO+YBLiPpqwP70cJou+rhPFPoD+H77dv/s9ZdeUvmDy5b49oVm+EHhMviCZU7xjXaS9e83MPoSl570YxX89"
      ]
    },
    "dense_3": {
      "bias": [
        "D2YMPeKagLyQNwQ62hQ+uvA6izy5DQQ9AAAAALJQBD04ggQ9lwf8Ow=="
      ],
      "weights": [
        "h1Y7v2y/xL7csjU+3K2ePjuf/T6JDT+/eNTSvrrVJL9S4s2+QAXwPsGkfj5erbG9iI35vqTD0749zvw94DbsPqhUZL20IJA+pMznPoBeJTyJhoS+IdabvryeQT5rkjG+X4WePraxer5uX0W+opWCPXz3or6jY4K+Zg/avR/1iz6tI+W+6JMHPSSMYD3d1RK/Jp1aPtSsBr+6da28HAtpvlqBCz+kmSi+VmC5vhLBND5kPPq+ip6aPj1Njr5zDSU+AwpivolRKL7pu4i+REdAvkxU6j6Vcfk+mDdAPlL2dz4Al1C7jFJGPTZ1kL2nw9w+NG2zvXdfkb5VwKk+GohXvuxSkz30ZUS+WtFOPg8Msj6kDUO+TQHqvtTMBT90BRe9BORxviKQer7ImcQ+YAyVPmpaBr5cI749a31MPmxOGb6WYHk+pBTlvsQK7L3NDN0+6vdHvqSCtb1sTMA9VgM5vkdGvT7AjQY8e272vbpxxr6vte8+mbn4Pq6qn74N+Mq+O9nlPv7Wvb7DM1Q+IoutPhJtBT92Z1c9FQGKvuIOaz6bIbG9Cw/6Po7EJ76lIwI+CBYZPU73Kz4OWje8yqR+PpCnG748O1++WwSEPDuhBD7saJW+5FQmPbZKHj03b8k+VaCJvlpkDb4zLMy8lpc3PmLGHr6wdCq+OE9zPWDcWL4Jdec+8GbkvopOtr6854i9p2+GvmI7Xj6Cg8i+lk+KvjrEAb58YHO+TFTGPX2fqz7p3QU+kn8ZPjnTrz51XOu+R+lEv2YdDD+Uk5O9dEuoPmO7qD6RPkK9"
      ]
    },
    "dense_4": {
      "bias": [
        "38MBPQ=="
      ],
      "weights": [
        "EegUP9rlXr2D4us+mThkvpxnPb/7sQY/lLisvsLSSj8dyLU+iVuGvg=="
      ]
    }
  }
}
