{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "main_input",
          0,
          0
        ],
        [
          "aux_input",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              50,
              6
            ],
            "dtype": "float32",
            "name": "main_input",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "main_input"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              30
            ],
            "name": "conv1d_1",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_1"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              10
            ],
            "name": "conv1d_2",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_2"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              6
            ],
            "name": "conv1d_3",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_3"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              1
            ],
            "name": "conv1d_4",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_4"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_1",
            "padding": "valid",
            "pool_size": [
              21
            ],
            "strides": [
              21
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_1"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_2",
            "padding": "valid",
            "pool_size": [
              41
            ],
            "strides": [
              41
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_2"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_3",
            "padding": "valid",
            "pool_size": [
              45
            ],
            "strides": [
              45
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_3"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_4",
            "padding": "valid",
            "pool_size": [
              50
            ],
            "strides": [
              50
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_4"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling1d_1",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_2",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_3",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_1"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_1"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "activation_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              2
            ],
            "dtype": "float32",
            "name": "aux_input",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "aux_input"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ],
              [
                "aux_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_2"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 20,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 15,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_3",
            "trainable": true,
            "units": 10,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_3"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_4",
            "trainable": true,
            "units": 1,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_4"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "dense_4",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "hash": "a4e1d40da595309db0c05fa774d230e7541572acaadeb205710eadcef50e7d23",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      1,
      1,
      1,
      50,
      6
    ],
    [
      1,
      1,
      1,
      1,
      2
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            1,
            1,
            1,
            50,
            6
          ],
          "values": [
            "5rlnv01ykT/o0KE/Z5bYP85UAT4PoNs+Z5HiP9VrsT48kSk/aAxzvyC5lj+/CTi8EEOPv2FpmD81dvm/2ql3PplG1T8umMC/E3GEv93u8j6iXRe+MLiCvyutnz/rXQC9ZljSPlfMrr8TR5e/cGwtP9hLfj/qj38/+vk0Pyd3o7850Rs+OM3wvnIerD94Soe9b1DdP/tYwz56UgnA6LBTP2UXjj46zYI/l/Jpv1xvjbyHBFM/v8CRP1CXoD9juN4/VCQ/PhsOjr+dk1w/vs75Ph2TiT5cDVQ/J9dBP9GmgL8l9fS+v5OUvz0yzL7Zgbe+Xe/FvfZbiT+/6sc/pIBHv1Hgnb4og2s+r5u0P4qPtL/J278+ztx8vvGRsz1S0gFAlW5vv19ler5SShy+4ifYPhIjB701cjq/ai/Jvr+job9mEQO+OhOMPyeXzD0uawQ//Un1viamtD4TgYg9R+ZyP6HICD7hEC4/2Mf4P0+snT/IODs/YfFAP9tqlT9tOeC+6Tkzvw9i77/UbDW+4tyhP4UFrT6eIN6+8oIHv75Kcr73fJs/6/OvviabDz/66o2/O15CP14Nt7+BHKE/J1AWP+8WRT7DdzY/LTSFvv1d2D5DvXo+G5QUQGKIe71C2VW/MrqoP1CrWr8nolg/kdDev5IgUb6cTfA+bWgJv/fMRL309U6/M3Hev6zzBr8FifW+oF3JPpCTL72iPLc9mV47vmESJr/flhE+Ht5pv7LCmr2CrJ0+Q4dkv9H+LD+7EYm/ZzNVv2Y5Rj0IpoS/uc+cPli/Ub95WY++/HDwvQiC3D4wIhi/YWIYwEiuab+9G2Y+htqwPjXVEz2rOpk/cPIiPxuVJD+zRHs/L8U3QPujAr856Ym/3OpmP9BzEsBbKZk/PvygP2xkPr9ytxm/TxCAPoRAsr/uRcG9WoqLvfm+CD7IevW/vQaYP03+Bj8p7tk/FWg+PyV/Ir+vmoa/WCDevjZJWr8Kyk6/VwkCP4WCRz/LpYC/ZhcHO4Bpdj91iEc/",
            "8Qv4PqGxVT9chbw/e7pTvgBRfz/Macy/E9MUv3lFTz/ImNa+PrUZwBn2Aj9AzEM+68FUv216XL9Fbm2/hrI4v+s/hL5WRTs99l8MvxaLob8sceu+EidwvzQdLTxte+Y+8COqvAjl2T44bgu/0D9BPxvIpb4pD54+GJKVv30y7b3BxpO+CUDOvrlgc79P8w8/iwxevvJ4sT8lwIs9scxJPhN/pD6SViC/rSZpPxk6+T6tx2U/fMiCPri8WLxn/ei+75CSP6b06b8IXg6/OOHrv3KI/j+hnsK+oeLuvSh0Db/BaHS8Y7L7PpdTML6IazM/7NqFv59WzL4Rwoe+QrOwvt+7PUCvlvw7PQPnP4xOGj9lWSg/ZLX6PnpqjT4GZ1O/mND4PodNSr/5t50+oXoZQGywH70lUYI/tisSvxPofT8LqBm/TJIev6hsgD8PAzo9nTWTPoFAmT9XLaU/OLSsv8ZUfD8sp8g+R8miP9MlAD8tM4y9rYClv8dvjT+qSvk+s3Vlv9mWgb6wsaK+Vqqzv9G20L+gERG/S3hBv7bM8r80C9m+5tKEv+BcQr9+55W8"
          ]
        },
        {
          "shape": [
            1,
            1,
            1,
            1,
            2
          ],
          "values": [
            "IFWLvLtz/L8="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            1,
            1,
            1
          ],
          "values": [
            "/SkMQA=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "conv1d_1": {
      "bias": [
        "hnOvu2MH8rvSh7g8RTYRPiGch7sKJR+8KpvVumc8NT3uv867fAcZu9sBOTk="
      ],
      "weights": [
        "52x0PJiZ+bpkGpo7F6v3PIfcwbyvkC28qQw1PLc8ZDwdez07L3VaPN653rwntFW88FZhPGKmLDxnr6W7t6tJuwqx5rzcev27BXXMu/yE+zvwTx68TD4fO7fc37xtZVa8iGOrPCIHU7wLtj68W8WMPAPCg7w8TQG8/p1kOWWAFrws+L28c+H3O3NUMrxuzuu7dCKYPETjubwv2rq8TwWZvImTnDt1SLc70koMvMkNJLylce+8GWZzvAYYfDkfqsA7etvCu9vzY7wA4xS8ab6GvCtE4zsEu9I76u+XPJqq5juunbi8JzBHvPg8z7vLCIQ8IOE5PMoWkrvMWRW8Ea7SvPmglrzP4Lw8R3j1O7OtlLwdAaO8F9JEvPfOd7vYf1O84mwWPHPblLx0rIY80B7CvGshADwyft272geTvOVZdrzujlA8awQmvOrrBjxAZWe7CD5DO8FOdLtTq9474/KGvCRwCLs/Y6O8JlaSPEYljbtMZwE8AKdIPKDBgTx3a928YIa+OxsAjjyAGTg89suAuzpaRjyV4IE8kkU5vCi2M7yrqfa79mkWOwstKbuMvqc8LVrgvHadELwc/s+8P3IAvB/q2LvIZlo8CYvVO0i0w7v7+CW7b+wHPCxDLbuep0G7XYaMvA5WuLyll5O7/rW9O4gEBDu+3n85YC2svF92u7w804O8e6wpPQ9CB7yMcc28S/8mu975HzuoVdm8BW+4POrlIDu43eS8l5WJu5askDyamYa8snWwPEM/XDysi6s7onmOOzojtzwYmyU825IkPehFEDwtPxe84mykO21yKLoklhM7ZIsJPUKMHrskje+7f/k1vCQ/lDzmGxM8hzSHPJEFX7yMJ4e7sXqavDPUsDyXoUy7NP8SPdBKVjo07GU8vc5xPKx5ozz9u9I8p7VuPB4L7DqI8Ig8vMvBu+AIlDzOqu+7sRjiPLeZuDtkzYM8yR2yu7/+GLwarvy7moZbuzJ2QTyw+986fSiNu76jaLttOwa8teqxuw+b8DuuzLs7",
        "5rcjOxz4Q7zIuxy8ObP7umLS/zvHbJ47wBkBPD3IR7y1cNy7lBygOg5pPjysBKe6AslWPHqDyLsdkOK7paquubPTVTy5DQk7e8U8O3m4Hrw/Cge7/jIWvALy2jt6J987zzAXvCdwQLwalpm74xgmuzDxTzuLtfc7v3sZvLx2jbulVgS86ZEiPEjSlTuokIM7m3TIupxqXDv6c986hx+UPBAZBzvc1Ac7oI3HOztUXzwL8WM7YBV6PBc1DDlUFao7dx+yO2go5zvr5HQ7le3JO4p4NrpGEoE8Pc4Fu1djQrlHB/+6IwIIOwCAETuf7RA8TSCWvMWxB7tu9g29qHxCO+6JETw+ooO3BbyNvO3lWrsAdwi9B8oru6FVcTz3BF+6VlQuvJ0baTuVqso6kcN8O+/spzspBzI78piPupMuCDxjyB08cNF4PGxFjbsF72w8A7UpO/F72jsdum47z28NPFbWmzrEUqQ8whuqOJKLULvldPA6LpOeO9j6JjtUiss73A0fu9TS6Dqv6Bg6tvsEuz5sd7tbgQC8o093O95+Yrvk1O872BBiu1PKQrzxDmu83M8BO4RnZ7t32Uo8pUZ3uF86kLvENr+7OkAdOyv7JzobmKk6e7tDPPNrwzsAnh08t/Ngu5o6qjqYe9q7AZQSPFmunju79AA8SVX4uwg+njqJVU+80+1DOyy40rpdtLa6fD6wuwvujrudx727EoI9PFGnELzgoxO7Gym1uxIZm7vRDEe6OWdRPAnF5LsVkLy77afgu+TpKbrGBio76/L3OxYOWjsrK7y7b8PKutJqbDtKyJk75RvAO8zisjvzaga77vIgO4FpeDvg//c6VsWVu5WbqjuVl0u7LBLfunW9qjtdysU78f8bvGY3MzuJhKu72akXuSCusDtM+w87aR+4O/0cGLvRlO66P47tOpqYyDjkVLQ72cMaO0K9uLpMPoa7Is0burGlQLoPA8o7htb8uXkUEruMWKy7FY/6uv8EWbouHgA8RTmyOxqPibuOJY+7",
        "v1RnugbOJDvAgkQ8XeCVO8zcuLvPwcK6r+ZBu1EvlDtAfOw7pPWqO4tSm7vt9w+71F/WuoWzbjkI83C6/QB6uwhPGrvv3Zu7oC/qu/1HNrtgNYK7fj8au8LdRDteMUy8mKkOvB1L4btcWAC8c38Hu3JH9Dt7uXW82JowvJ7717vnrji8+ScquuyEMjzUEgy8fIpJvPbaVzomhbK7ZbiaO9Jm9DvUNG8744QKvMjf1jvCvz85cFtAu2B6GDv4ym085/wFvA6zljuVpko8CIvnu4wcObhYtmA8Fr4Nu575vTpUFyY8C9HHu0SJT7k6dLY7UyGuO73ZJDojxBc8IhHoO6Aes7o4xsQ6PuIjPMPaAzyxojM7ATJyPK4eBrsxwdo7A9BdPJaCXDu0rB68gb/9Oz841zpflhM8E+4IO+puwbqrLq68SSwOO5qOSzx2H4Y7WwY8OeaEaTsQagO8SkW6OgHxojy2ksQ72hjLOgQdMrrrSa08hk45ugHAQzyS8YA8QPh8u8hslbzJ74I8eYwDvAiig7ol/RU8PF+HuzR7wLxOVB487ggLvLC2WblzU0M650pUPCmZUbw6OpQ8zv0BPFVGKDxjCgM8jGQRO/FqeDpa2fU7iiTiPG6IMrsErYA8kVs/u+dAwjtoSqg7thVlPLgU6Tf+Dz08jqu3O89B27u3WO475Ryiu+cpbTy8T+U7T3e0Oii5/bvA0gU8JnnKu8F+qzwxqKA79aYfvNxk37sdptU7ynokuj4RRTxWM2w7DLYuu12hxDtWvt67FsRru54CR7sKgLO6bcG8uhCdCjx/ojO8u9DTuyUGJrxBRRu8JX4+ulC1FjvVUYY7A+c4u5zR9jpuoDY7FHaHOf+22zp2cIQ7+05gu1vJ1TrBTBA78t6yOg9JH7r/28g7a2imu6gfgzou98k6gzjwOTs6M7vDFd07QziOu6WKazrhaHE4JlifuvtXJLvq4KM7G3LaOV7E8DoWyGy5m56Huh9BEDrfmlU7Nd2sOw25MzuMylI7",
        "U4vLOROBjjvfcoU7o0XXO3zfDTuoSdA7MVXiOnIn1DueKtQ71Y6PO6kmZTq6lLM7dopOO2+V2TvmhdM76LwFO+PpZjp9Ikg7aOpYOxr+yTuqrpM7E+IwOtLi3DqpUMo6C0MrO4yBsjuB8G87XR55ut+r/jo7TVI6+bsLOxxWmTu8p4M7XMIxu6XWqDprI3+5UTbEOgrQhTtr4ag7MAt8u9RrWrktwcG6cgYZOokSUDutscw7TCVuu0Gd77o2Yhe7m9WROc3bBDthKt87SoXRukR6MbsnTyq7H5/hOksx4zqjmA0885lOOuA6ertPOxK7rFpAO5zpATsADfw7xBzKNktXSLvO5iS7PhmYO9a2czsasQY7nyQKu/0OLTsy77u61TLWO8qBzjtSQug6vk1vuj8BsTvzVZo7tf5WO9X9XjvFjLY7Dqgbu92t4zq2W9o7G6HjOhEiXrqI/G47u7Fcu2Wr+TqZO+E6aLIkO67VhDpkbeY5d7oHO8b3wzsEx0g7LDeDOnWXfTuvsHQ73eSWO1fcrDtb8xo8bepSO3KYmjtiFVc7ze9PO2qWjzs/DuI7X7xyO2YNhjsm16c6DZl8uvylwzuMSaw67xnUOo6SjTqo2Ko6PKBAu0WtmDvQzAY4m60PuZP5X7p+Ukg773m2utb0GjrtpCe6mNSnur9I7zp35E07MlhwuoyhArvkIHy6DpRzupPcEzsLKJU69ErEuqC557pGG+65c7E1utAtt7l6J506n70buusS37owpYs6H/4DiWeCBgmhMAWJsuADCQ2X44iFevqIa74ECe6YAImXBwoJVggFifTK74gKW++I69YFiQf4CgmS0AaJk68FiRCD/YhsiPqIatgEifGsBYnJPACJF80ICbj1AAk86QmJUQkFia74Bgn6UAWJNlAGCQ4c/IgFUPmIiycGCeAkBQnrSgQJLxQLiccw8ogwaQoJiPUNCc7+AonfWBgJAhULCait/YgGXvaIl5EHibQF/Yg/Jw6J7vYLCRtJAwmZEfOI",
        "tw8HCQrU+4jWuvyIviwLiQ68CAmwMfuINO8DiaBZBQli9ACJtskLicTt/YhqJQGJ8Z7/iDakBwlhDgCJaocCCdL+BgmirviIuj4CiduYCQmQRAqJNtsKiX7GAInnofeIXMcHCfD6CYlgZwUJa18ICQOEBQnv3ggJUncNCTE+BYlgmggJW/gICTW6Aon/GAGJy4AGiQxZComrVgCJ3/wDiWBMBQmxawCJ6oQDiS02BYkp7QeJGN38iHRkBgnquAOJ954CiYrN+4jX4wcJdtMJCUN3AYnm8PmIGD8HiXaT9Yi2EQGJNpb/iIQpB4m5zPqI2gT+iLqVBwnNY/yIzCkHCft5Aok5KASJvNQBiTc9BYnHGQYJtVAMibp9CYlr2wYJ7u4ECTgnBonQ6QeJoy4JiflX/YgBphgJqQEFiQGvBomLHAGJQhsJiQTVBAlcfAQJF6sBiWQCBQk8fQOJLSwFiUZO9oho+PyIA3IAiQOECwlERAiJxv4CicYL+4jj9ggJ6WwJiStt94h4FgeJ6+f7iEie9ojYoQWJcYIICXvn/og7mv2IhKQViWaP/4gl2vqI7XD/iEOH+IiE9gCJUDMECU5+BolnygGJ40cAiZxcBomA+AIJfk8GiU1CAYkjLvuICxgDibteAYl7xQSJ2agEiZbpAok/cAsJMVoCCXCs/4jvCwCJtwcGCfeQ+YjW/ASJf8g9CRfjM4m451eIXFyViAvtcghgnkIIqwrrB/gsbIl6LQKIC6tUh55YoQiycgYJE0YtCYjoEQkbAnAJK/ZQCYmBFwkGHWEILFo5CJqEx4hAvekEvryRh7q/owa+6x2IqYcjCXyOAgkqhwMIYDVmicwUowiJxp6IorM/B1fzo4guXYMIXZFDCVarAwkaywkJNkxEiXEgbQl53AWJwePXB63DaIlvi1EJp6+fh6mNBIk252MJuQKkCJdAVgkHCIKI7ynXiLaPkAhrfROJyRIqiSASYwhcdTYJ5nsDCRbbQ4lfkT2IdYfviEcCk4joGMeI",
        "LCYGicxkVgje8fMIDC/8BqyuCYhDFWaJYD5VCcBqxgjVsD6JFBQCCfJiHwn46yEG4bEHifFbUonaTgaJyx6WiALAyQgPtlaI67r/iCbrQgn77G6JcJN7iFncQojsB2wJuA5ZiNb57oh3dmqIIH84ibO1BQm6ts6IhoL6iB8P7YhFJQcJJd0+iR8q8QgrWzQIWiKliJbhc4kt+3KIBoqSh9+glwgAL0GJ7W9ribqIQAhUrP4HwceDCFSfn4eilOoIOg+VCDNOGIkFlhGJFt7kCOnyFInqDOyI/lTgiLxaN4jvh2oJKatpiNwUcAncow2JGuWXiNs3UQhxjkAJgI8qCAzHZIguCI0IL42TCK0cbIl/0zOJC5vQCL0qlohj/C8J7iMjicj8IogaLfcIwdT7iLyY0ogJ+T4I2R7BiLJNc4h+ViSI7+T8iNAi2oi+WHCIMjXxCIDURAiFaouIuWhmCbr5dgh2oAmJ3uwRiU8yRonodfoIkXxtCUDnXwn0lcWIlkoSCeWs1gjMvj0IVJ2jCGD8CIliRYMIQJ5PCXC8Mwn5CBaJASH4CHDqRoZbF2YJg+0NCTqQioYWyWyI73cRiXbiXwmOKiKIxCkuBq+6ZwmWJOaH9/xCCclPc4j8CVuJGmMGCXghCIlEBg6Ji3sLCW+CA4nvGAUJ0psMCdfGCwkGKQOJ0m0FiVcHBIlmxAkJ9IgNCRoYCwl3oQqJTWQNiRbOCIksNQgJ+58NCcNUDwkjHAiJAIUEiQ1/CAn2GQwJ3LcLic1MBokuugOJGacKCQCGDwklRA8JIWsGiXVAEokWQgyJ/H0QCUfmBQkRTwQJgYEICUTsCYk3dRGJRiAXifVIC4nKjAQJiP4DifUqCon18Q0JaAULCWg9BongtQqJ4ksNiVk6DgmJ2AYJn80EiTpXCImOjwwJrJYIic6wAomZ4hCJ4r/8iFj9BwmsoggJMjoDCXMXAol8bw4JHyQCib+HD4nUxg6J2ZwFCcetAIna9gsJaVsCibEkComSXg6J",
        "DfEICXGhA4mvsAyJbhIKCVATAwlVFAoJKX8KiTgOEIlmOQWJNXoIiXewDwlNrgUJxgsGiVYuDQkXcgwJQNsOCcArBAn/ggcJze0EifyMBQkULgUJcvUNCe3QDAkwAwcJUpEOiRFPBwnIQAcJBBIECRYfDIl7IwaJWyYKiYuACgklegUJAgMHCeLSCwljmgiJI9EHiT83FwnY8ggJv64ECVtsC4k/SAaJmHwFCco2BYkXiAcJo1oJiRkQBAmyfBGJ8OEOifpgDIn5xxCJhS4LiaVED4mwyAcJzR8MCUwrA4kz5QuJk1UJidq8CgmEygmJWngJifiwCgnnrAOJEnMLif87DYlovQeJlFMQCW3rDwnZZgoJn+AOiYbbDolJzAYJ3oUOia4wCwll6QqJ5QsKCQ6HFQknmwOJ1ToJCQHUCwkPqASJoncGiZXQComBmgaJUp8GCWmuDwm3yQSJuHQMicobBIlA7AmJdusNiXk4ConbDgUJjgQJiW7oComANAuJ1dQMCbFjCQlTXwmJbFwHiUo9CYlPHg6JVysHid1ODAnESxaJwYsJiZpjCInICQyJyVKOO71wJLstmAO7otY1uUQnYTy2VMA7JCELOQxQebo/+Ru7I7AKu6zUVTwHtyE88pcuO5LUrDratkG605tvu+9/QzxI/B88cxhpuzZQoTvyuVo6EhsFuwoGsTvaQks83y6TOtAAUTqbuZC67iIqObjvq7po1yU8JPAAPL0cDrrAqOe7T3YqO+o1H7kK/Y87roJCPFi32bkz0g46nOOiO317BDr9sAI8bkZePMdM5roJKq48cMPFOn8NCLwePy48r+zDO56/cbqurxY7hchNu3ZF0Ls3vVg8p/wJuqaVUruQ+4u8Ap+Lu5EpYzvs2WU8zo6cO2xySTptA9G7IDwNOsGizjuIB0Y8JJn8O78RYzx9jyM7UAmfPNaUSjxRBGA8IgPDO0NnnDza5BW645SnPNXfNDxY62s8D73AuSuaAzxg9oG5VEhlPM1I9Tvej3k8",
        "Tc+Qu7vOuDvzMmA76URHPFlKOzw+hVY70hcWvBCEZjt8KGU8r48KPKA2LTxyJxG8sAaOu2RQsjr4PZw8+7q1OxbEvDsWFuS7T/jeO42otTsxI808bY0SPEprIjzXNy07qdIEOjzROjziPJE8WilBPH/6PTzLZ2U8OIELOxQ5iDx8YTs8H45qPKBX8zvzyjE8kfgAPH8fhjwkJ8w7hVhVPHMV2rov4Po6TElwPCaGMjyN9tg7Slp7PGapxbtAP8a6fbsEPJbinDqIMyU8/f1zPLwTujuhKZw7U11oO4iDyjrW3ys8tW4wPA08Szzq/hQ8xVe2O/evCDx2M8c7EocBPHv3MTz0JPU7ykEOOyaYIzwoXWg8+NvEOrMA0ztKwTk7ebgJvGv23zsSgVk8gpUkOvIydTvQ6zM6kRB0uxHqYTt/YWg8aiHnO4mLnLiFu2A7dLwtOe0rEztJglA7qn4FPMMWTDoP4hI7PRRhO2OdiDt3uLI7XEveO6l+QTs6bxM7fkkBCS6ITYnMl2gJ6hxFCdr7cQmYgk+I19l2CGiWJIhOpmoJcBNZCRL77ohJhPmINFJTiWLlgIepKUkJXwpliUqQaon8H+II8Nv3CLwlVQkWZy8JEDQ6Cb5G+Ij+qPqI9YZJCYBVCglkMa+GAnOsiF5FVwmIQgiJKlRdCQGf0oirQskIm5gTiYAiigY9QhGJUmiUBwALNYRCBoCIirxXCf90lIg+XMoHt42aiPb7awhbfEWIqH4jidiZ9AdKR2YJxDZCiVn5RAnCMCQIYVxbiQ0Q0YiMUh+IHGZfifWHpogmBGGIwIolhv38xYgj4ySJKOpTCCbZQom8gBOIF6vJCGTZQQmdK2yJBnYDCYfHYIkHsmWIZIzACFADtQYE+x4JzhMGia1J4IjOHNGI4QtlCUjSCQmmwGoJYDxfiZYdBonMQWGIzAcKCaV+vwgbBmiJsIeXh7oC5YhW8CaJEew5CShDJgn4MBkId3sWieCwqIXHIBiJ3Us2CbLnUgkT+CEJ",
        "zG+QiEWMCwly3GCJnWfYCMgITwlmWWCJLl1rCcfHaAgWxTWJh9c3iWD5KAmRCrGIdKlmCUmJcAl/em2IvNb9CEeR/YigpDUGk1LIh7aiWIe+KUkJAaIUiL52SInobrAIxu46icTTaYmUwaEIK24kCOgyFAkmMCUJk4U+CasDqohU382IyE4nCP5IvQd7KS4JofRziahMRYk98XmIuTsliTv4QgnkNSkJ+aNoiVDPeobMpQCJak8jCKAEnoYAhzuJmcOcCPqBCwkQUluJhKmCiMO05Qi+ySoIYb+nCCYpyIjmB+4I0rMeCccNLohLOMcHwkc5CVRVNYlqPgqJRuxrCAx1MIm0pWyJbMwMiA/akgjCmUyItwVTiCejvwhESjcI4+QuCZHcpYiITjsJcO7qiJeGSold1vIInZDHCCae7AguQs0IatUmia40Rgg4a3sH1URfvKHpAzz8B127/oVFOomzCrzFHxo8Rt9NvJ/0zzt6N1a7S2bou2vGu7tb5LI7SlEzvCLevzsBaEm7Diyiu2WcurrKri470Hs6vNZnMDuybGy66iVLu7SyITsYG7G6qJFhvAHovDs9C0g7f70cOzDIoDpX3X+7oeVzvBEGTTx8JT+7Wzm0O89jFzqktea7YU5gvEJIijzDMZW7DHK1OYdH4joketC73zlKvMBxjzw9E627PUDUu+RKUbo7c1q7La2tu2kQEzzOTJO7BmsovKI0y7tEiKa6FXGtuwic+ju30cM7gkGEuu3uOry+M/+58DBfuwAQ/zvXzEo8JsCXPEWmb7yoJSM7/2k3u2hLxjs8iQI8AI7BPF2kWLxAZiq60/g6O33Fbjjrl+M7aph4PH3qNrxqLwy8LGBfPC0dpjtC7PU7nB8Uu1K3KTzAW2C8lEhCPGVmcjxIotk8tGIOvLqcGz1B9ZG7kKNZO4+5HzueF0Y9FMlyPM7lCD0DX4W7H2wKvCa/y7ztYNw8vMekPNCnmLviFsK7B8KsPMyqGb1von07cIF3uzH5sbwWgrM8",
        "DZQZPdkOO7whmc876iEjvMfOeTzMd+k7LHYtvOsCqTwHyEQ8W+Xnu1WDDz3BgQe9SBLUvNU9Ez1kPcI7ubNSuocwpTxN+Zu8SydmOsIOWTwzN4Y8MEBFvJpWRzqKkuA85Lmvu6Nz5ryB/5a79guTvCb2fjsI1Pw8MU3Rui/SzbxXzgS9UD7WvIykGTyd1hY7elKtPFE4/Dt0pxa98JKzvMlZW7tdeei7UqhEPHSJWTowkyi9lePAOyojnLxnSIm7jQZmvKCumbzPSRq9IjK2O7cEmrwHlwC8DEg0vHPmYbwX3Eq8oyfNu3GTUbxS+rs6BniNPBowRzpYawW5pFiEu5/4t7vvCic87cLSPEL34juqIa26fUwzvOZa+bp7Ldg71z8lu10bhLtOCc+7lezFu+3KIrxFCXW8EG8evDdGa7yr6D+7nzf3O6CSg7t5bJK7xBJUOQuofLzeDo+8/r5qOw/KMrtoZEi7zrDKu1b/8buZQVG83Y/wOJU7WDuCEPo7Z04furSkZLzxKIO8Zia1OlopazszJ9s7zh0Nu5qgT7t/tHe8NkPTuwz5W7dAdFY8t+RCu8dug7zpdwE7FGYevJJho7vjDwU8EmiJOnFSg7u8IC88qnmHO6wsNLsTnPo60yLku4T/Bzx5kRa7ZWmHuwoau7t7LE47WS+QOlCZajzGRW67336ZO6Mgzbsghfq7lwcMuxAbvjwoPJC7cZuTux/0CrwCTqo6p2lMu7R9pjlIgcS63nMJu58z2rtOSse62ma3OwcxWjzAfH48FMGsuwjDMzwdEDo7DxSFvHK4qzxjuvW6ucuqvLBnMzwOWdw6vS+XvKF11TpiVYE8wx2SvCoH6jtcZFC8bxcevKsMZrri4b07Y2pbvIn1T7vy94C8IqWnO89PJzuCwEM80zysvAKtXzu2XwW9qpZNu8s/nLtlOJW7oX05vMKDoru4RZO8yTnFu7mZhTqb4Pk6JGDVOiE1z7yQpV66a0K6vMvP9DwkTxI88/lIPAjWCb2L76O7",
        "YhvOO0yGJjzoN4+7iXyIO0hJhbx+2qk7tfMyusUaPzweEpW81jiTvFkuEjyjwCk7qGGHPEQWCzsdaKe8IvoMu0ZNDz10RDG88rA+PNXkpzsCSU88XJuEPG5/Fj37ZIE79BNfPBOUp7yWklE8+O2PPBH45LsQ3+E8R4o/PA14KL3BZ4C8bOiJvIxLwbwTYPc8NVSIPBwyP7yCKsa4Y4JFO0uxGrzMy6k8CcG3u93PCz3oeMc8zGrwukKkuDsNyss7gJAxvIisBz1hpBw8rBG9PKIe/LtNprC7/3iQPCJBAzqhtJK8PrYUPCaoIDtZSMw8"
      ]
    },
    "conv1d_2": {
      "bias": [
        "TqSYuyo8r7wCF2S87p31O2zNCDyexi09VJ5aOwAAAAAfINy8B6AkvHSOgbw="
      ],
      "weights": [
        "OF8RPNmL9juysRa9vyWKvGRB0jwZjR692GUQPdUqET2K+Sw8GafSPGtTLD0diwG9D87gPFqiDT18GTM95yGZO1J8hjvodJU8MI8NvbjCq7weoqO80MZCvPfUF71C1Ec7ZVyHPN82EL0qVl29wIuEO3A9s7re0t48ZTsOPLplxbtcsA69Tc6Su0pglDwDNrC7Od74vLZ7OT1+G847xsESPSPS+jwY+OC8s/ZFvBhEITygKl89F17dPPhotzt9e8c8G7VIPP01l7vk5lI9/vsGveHmgDuhOpA8zWNAO0Et/7uTJjY9h4MNvdufpLvYlpI84AACibru8AjgMvWIW5HuiCMh/AiiLPwIf/v2CL4UAAnEJNeImhUECWx+wYgr+OCIv4iwiKf8+AjUIfuIWpj4CL4WeIg7t/YI9cX5CMPKAAlhHfoIEJfmiPmH5YjbyiMJ2UzwCAwMtogk/f0IP0D1iEhE6YhiW/OIViXRiIlRWgmy3r+IaLvhCBsb94jeF5aHh7/1iO+W74i0X+qIJ2GeiMPaIglK0IGIfcTtiDG45AiPqvCIlP/3CPyV94gItMaIcIr0iMzGyYhBsPgIrukACRmDLQnglEWHiZj5CDUgCwl2Y/6ISSDJiB3ozYgALNWIrfzbOOgI97sw9fu8RN4NPHt4tjrLx6y8zSnhOnQRKrxayIC8q8yOO/xH9Tu/VYe8SpPlOqhSEbzz/Ig8fK7xu9ECCDtNYoA7B2jVuxstgLxgd1s8fjnTu90mPLzR1Ju5dT6RuyT0QLyfm5I8k/Suu94GqbyPfQs6+GYIPAcVDDw7Bd08eQABOh4YL7sxZ3g8Uaubu4eaSzw2Opc80WGeOzfah7o0tI88/2iPvNyENjtREAI8LlfIOziqSbxQLf87MG8ivH+x2bvz7fQ7DfmyO7PNYDuVXQs8D9M2PBjP9rvWF5W7O17Lu2q/jTzzrUA8PFSdPMKN5Tt8Jho8bU/1PHvRhzwBOiS9Pit2u5IWwDqkIzE7Ra2hPMaddDzT9gq9",
        "pKk7O+2sBLudD2e8+35BPNo+wjtbq9G8qqD/PDxA3jv6jPI89GOSPG1QzDsj1Xo7eMH9u/fUnjqss2g8lmFtPFy+xbtdsr88RBuSO7BYXbyB7vs8D/M0PBSp1zxC3LQ7ZSGLPIPqXLwdYaQ8+pXRPHdSDz18iYY84ig8uC1eAjk8mIw89IU6PZwH5bv1P988aRdaPBo0YLvMgfe7SES1PBKU1Tu/HA07muBrPE+wjbtKD8i7ajgnPGKzdzw/TWq8Gdy9u4m2t7tnd4g6YFNsOqc4tDvhJYC7OdNCu1cks7vtQau7mmEjPM4L9rnjZ6A7pH5Bu39MYLvdUCW77a+EuWZ7h7t+PUm6r4a1u+6BKDsrD0s79MCCu/9DibrlvOq7lYbkuxXCgjsfoxa6f/nmumCVkTlIhL+7I3S/u9F4mDqsNxO7IuqKuqdTY7vL0e66vGISu4xwQTuSe0K7CngBu8vlALx9/rA6c+lQO3divjoa+wC7wNU7u0IgBbxw2Ug7knGWOxYZ6jqacNi6wbWQu7Ycvbsgb8M7rKGOO15tiDvjVOe6OiTDu6D8WrvP4LA740hSu1xgB7zWvI68pSL1PG3l1zvExv665siGvE50pLjoc5K83wUwPK9SRDyc+8Y47SanvD3dYTwP81I86HKGPNgduTxmzb08HXGTvJEjZTwZKby7U22pPF4WFjxk/FM8QJKoPO/4ujwIKqI7+0WEPAnknbzJk+q7UkIcPfIljzxFmHC8728MPeP5V7xzKiy7opHKOSSmkjww7j68yj/lPEomgTsPA5U8YryguyrxgDuOyJI7pWxHPHaxlTygj/A8T+YcPKTrLTz7x3M6B4YUvIkzEjx6dGo8WUKPPE1ajDxUxjc8CrWgPOtQNzxQhc47kN8qPJzSorvbNbs8NeyEu2nOajw1tKm8HIWtOtuSoLx8Od48qeGCPFa357pqaeK67liEPFgDnLy71GI8VQVcOwC33LxQ30I7BRCyPLPfxLvHubs8faFXvPj4rLwk9Co8",
        "l8hiPHuzsDzhbkA8AzG1PNsIRDxGscs8nMCau8bgE7zzPxs9PaY+PFYT3zxGpgY83JU2u2mDu7xuvCI86htYO/8XBz2XttM7QEa8u0/drrzWJOs69m6ZvH10GD37sYM8YGRIPNl2R7yIn028XE10u5ihyDxxvbM8Hbzku6+AjTtbQfC8l0rwvIUvCDv7MP87lPfnB2i/J4htNSuJfVhxifACRggMkvuId0XuCDI974jAqhkJ3K32iEbc1ogyPrUIzFFQiY0t+oieg+MIu1pxCGwu04jA3XWGSqZQiZt784htGWIJPkLKCO5XnQhpwfGIVCEHCcWq7ggMvSEIW0ZtCXaSEYmGpceI6GkJCSgn7YhGX+YIkDVYieny8og0tPuIiT57iKhIJ4i20J4Is2hJiC3AwwgzCmaJ+sTpiAya4ohGIkeJZbraCEPRGIkaKsQI9lnGCBfnXYnRWfeI9qDgCE+LcIjSyaqIMkWSByhH4ohj3cCIbZn5iOKV1ogHrw0JuC/Bux7ALDwpwNA7lmmLvNStELwSMBG9P0biPB/jaDyXchW8LSpNvAza1zuHzrq7kFoSPRORLD3xwWE9rAEHPCoMRzyBGSM9LxHrO3j8Rju6h4U8SXxZuxoleLz+aqs6zLyavNFizLwynk28ElrOvJxEYbvZkJa8yTmTPP4ojLvzo1a8boYyvSIPczxnnio6weH8u+/HzTtXbiS8dC1+u680yrt68wY8HbBRvEJJsjwkxuu7qizRPCSDf7w0izm8CvuJvOxY7zuRY/A7JvIevJ5FvrvkK1A7zfo5PBHTjrzmvcS8P2tbvAAZ0Dy+ats8RkIavAYPBbp4GpO8SPRfPKUMyzz+72m8EI91PH13njvTQc678BtPPPDnrLtF27c8UK9DPKku97ym/cc8QfOpPNuGKL2jFVM9cx2APK7EJ70ElLy8PNsLO5hFjDwRMAo5CY4AvY27Urz6U4A8NJEZPe/BOry9OoQ8oSyrvNMsSD1oO049jrtvvMdhH732zbq8",
        "L6UZPdK2tTxGRcs7Nj2/vHeEp7uPrbw8NLfCvAFQEj0OZDo9X58SvWDpibrLnhw9G08CvXzkiDy5JYK8LKC/vIhoCzzzJUA6tfiOuzeHa7t7gru8CbsYvZRWALwneAi8wYgwOyG08bv5fJU8315DPPsjujtnen48z6LDORDqtbv8rwg9pEwoPD4kZjok13s8KeEHOlGlYLsHEps8HNcAu4IKATvPbfU7o9wNOwvg87pOSws8KA41vEUDBDyg1Ju6dwBGu/WlHLtvysc7TV+Ru/aGvzudRTW8PlMYvEMSjjoolJs4dGbZtmTTADpU7yq8/RobvJ6lfzu9LuW7Ca9PO4tchDu29po4Xy0SvNWozLvKSQu7vXhKu2ErJjtMVws7dt+7uxQ0o7sSAhw5olLou+5xSLsrwbY6vUudunj2KLvYAIu6GSPWuz6lzLsmBEo7"
      ]
    },
    "conv1d_3": {
      "bias": [
        "N9+1u0HfzrsyGIW7QQCwPOh8TD0seQE+0uBAPGB+vbtA4CA9FTawPOrMVzw="
      ],
      "weights": [
        "iqB6uR/CY7zohQa8vdJDvHXTrTsO4+S7o+acPFU4bLugfo488B50O2SsWjxyM4e7BMPEO3ltWTwoxW89wq7gO9u10joxBu08blpAPGJkQrs4k0s9REXhu36vXbzAweA7+rGSOyuELLwK/AI8GCF6vJcJ6rnsHwm6IvbQuiA0K7yshH88U6havN/u0DzjcoY71F4DiZwT5Ii4+j6J+c0liQARx4g/1KsICK8SBpS6ZDdVhvCIBorniFiCSwgk/2KJwcwLieYDZzcKGjUJ5s6TCPNE5IhbpO4HCifpCMqZqoiO4TKI6pSXB+qlW4mKLRwHXMP5iNtQKYlB/R+JnvGziHYcRQlwoZSHDSBJCUVdTImFVVQJIsEDCeg7ZAmYSyEJ9mpWPOABszuYe4a8k12suywNjTwvXmU7yGmGPHnyBTzjybI8ANUDOUgipTy5xHI83u1gvDf78bu/tp08DkCGOXiZNDwQ8wU8wcw4vDbclrw/kCk5NAQnu8VpJzqLxbY7lh2APBmIAbzKdY480IPgu45tFzu0dEc8QdQJO1J5n7vmy4Q8OPS5uxDPADwHY006j4OkvLgkubzGN+W8g4TNO/SjozvwWDS7UVeEvHMrS7ybQiS8gLU0PF2vO7zp6rs65sa4u2TB/DrCcqc76/iXuzcKdDtsB7c5UMIWO42YhjxJhzc88jpaPNIBKToSfS0852VEPEnskTwf0xy4EvibPKHMp7wTdcU6PN96POTkwjwYMpC896qtO1v/zLy6BDG8VzZLu8n6tTtaJhM80N+gO0GfVryyjUe7Mcr4Oi/DRzsQVHI7E5dlOoidMbxpsXi6b1XoO39BnDu/H9O7dQADu0pz7LqmVJm6XydSPHi66zvzSwe7spsTu0LVqzuv1347PCIAPLhHm7kQwC88frZSu7iokjv+W407Ch9KupoWxruHTJU7qpx1u+bR2TeB0Yq7+oafO5tLvDsUpY46VQ2UuoUY3LlI6de6zkqlO3m8ojt5uVk7YaEPuz4JGbqAQqI6",
        "gp0iOlOq/DkEuIA7+zUfuzGxPLplgrE6THFRO9x7HLt8KrA74exbOgmaSTsZLKU7fkNbO1vOz7oBCKo7mrFpO2VMPTsyhPI7zXGlOZvjHjt/iHY6I3KNO4yYBjoKkh875oFAOg0K6bs/l8y7c86VPCHd1DwMX7u81dSUPE+XP7w3CDm9uE4QPFuurzs28N47zEuKO0iZ37z33RG9+bzEPFxS6jwzawQ8KCkGPGwlqbx3WDu99fTBPLcHBj2XGBI9XmEtOw9/2bymBiW9Ug6cvMoWpjtLIUU88zzVvK267TyKDak7DXwZPVstQ7sydp+51Oj+uwo/Gz0HFrM8mxZzPJTbIbyVVye84aUePJiiojyCq7+87PsJvZFW5zxOc8E8t7veO/0cX7ymIFe7HGCQvMQKGz1JRoS83Hb1vKtyS7315I28t78RvH87K7yeKVK8R+g2PZUoHLtXGW08N/TTu26VnrzgxQq9tw5zu68JlLzL5oM9GtGXvHKnGL11VUE9xgIsPBxkMTwJqL47O2/qOv3I5LsPfQk8f3gzPH7IAjzx3Z4842HeOtz+/LsDkrs8JykKvG9GjbtrBTU85j4QuqmTDTuUwFk8PsuEu1TSbbvVmYg8XfKtO229oDwdzy48AMpNO0VFFTvmGlg8aXykOwKzKzw7PWo8U9zxOyn3mDrygIa7j4ksu+3iV7uPQJU7ifEfPF3sqTuM+yQ9tzXMO3+SEzoqngQ9TsSWOD5CV7tVDyQ9NFTiOfzJiLz0dYg81z6Yu0+zVbzvDFk87uc8vOilarwbk8c7bgbJuVpf3Lvq7e08Fov2OjyO2jzqooc84L3ju5SGyrpmTjs6zijxu/qBm7srJcM84ZAEvPD2u7u8utM7QCp3uism6LnemBQ8tOuhO8xjljw+FmO8J6wEPa9REju6T1G7izs8PPliITwS2VQ8wkCEPPWHBDuuav86//BrPK+Q0DvTAUY7LhIjPAaMsLzABty3TiWjPMWFlzyKGLs7zJ0rPBWV57xD/b27",
        "uJdXOVdVhTxZ64Q6FJN8PEqMtryHrpE7szq0u4jlozrToC+72xqXO+isTbztwf87"
      ]
    },
    "conv1d_4": {
      "bias": [
        "l5DzPLyVtz2IVoa7JtmLvCdoL70184C7AAAAAFkARj1wqIU7K4FmPcZ91bo="
      ],
      "weights": [
        "OpWlO4UxrLxdQsY82Mv9uwZ94LuENII8GWt5utSQUbszG6a6EM67OtJ4Zbl0MV+5u7rtiKvz3IgIhfSIRY/1iEKD9Yi8fvSIHoD8CAGGwohJ4ACJ2Jj2iCx09QjCJPSImvn0iDGx8AjEowAJpm0DCSR1/YjOOPeIWGmKCGhs1gXuwF8IGNlxiVQoYAkEBXSJ04z6iKMU8ohyXvmIZB/viBgD+Ig2eQAJhSMOPK7UADwg9pk626mOPEVHUjwJS1g8zFxWvPcv/TrRJTM831ajPJZtqrwqRoS8c4qIu8nGlbxHs5+7harmO22KXru4K4A8pSI5u7qx7jx7sdu7NpAqu6L+U7x0/hy8"
      ]
    },
    "dense_1": {
      "bias": [
        "U4S/uTXOk7uM8k68iMcVvA2pGT2Sgs49qBHRu/p0L70AAAAA4AbRPAoNtj2lctq8AAAAADmMTT0AAAAAgfxwPOZm2rv5lkI9AAAAAF/DWbs="
      ],
      "weights": [
        "Z6Q1PuYD/L1KkZm+aqOXPll/AT/6LDa+yDWSvQtcrj2YQci9XypOPnwEGL7jY3U+Wn4/vqVMED40Wf09cESqvktBKL8mZwY+t4khvrsC5z2Bv4y9+dYqPZsQ6b1yWIC+toiNPmyvwr4xJyW+iGBtPkyXT75Hlu68Unm1Psfijj5AKka80f0Mvuhboj3HsT6+Y+OqvjdOPz3oejg+gxZbPk1D6r2gYFK+2ytIvjIYpjxN+Jg+rbI8vrgrcr4v60G+zI5QPp9wkb0i3mE+4LNwPgBQ8TrN1CA+110zvoeLkz7O6Co+aIeOPhwyXL3UZ2O+gcwivqaDjD0uKhO+tat8Pn9crD6jEIo+E+myvVN1l74Q5pa8wIrjvJdC1z1XUpe+fIXyvSv4oj6werI9V5y1PRCQKD3QyOU95jSQvouwEr0AAKs5YVTEPYG5jb6Ae948w6iTvn/li75sbcA99AmIvbiJ7z1va4O9GfNBPSHEfL6yXnC+n955vqCEvTxS0jS9WG1kvQRCRb6q/Ji+pXP4vbCeib662uy94xwqvugPPD0FuPu9P417PhK+Xb7wxIQ+0AhFvq4XG76p5nm+yn0/vjyroL0qKlq+bmwYviIYN72R9Q++5MBRvtRUkz7wGxa+VLLVvf0QEz0HJ3S+rMV4PgqvFL5l2om+a8qHPqybUj7ADeC9gfS6Pei03r2/0pi+dUdHvsBoMT7TGky+QfqiPZ6voryl+C69dtpZvl+3jb4KHzm9KCI3vcaclb1DG5++rF5EPrzMXz4FlWW+LgykvvRiab0lLFk+n/A6PrtDxj26sYe+yUFvPh8/O75JUYI+17YLvuqKMruA0PE702OZPvCxyrx69pE+QKG7uwDOOD3qocm98gKavZxIXD4cMza+9J54PhKml728OMQ9cOObPUS5nT3tq0y+uBMvPoA/AzwOJae9bG9pPoZWCz50AmA+Zg2BPj9KPD7BcIc+6MhvPrl3lL0ljZS+oynCPX3/Fz4QbIc8efb1voJDU77wMxe+",
        "z+l6voJXOL6QLIC8/WlVPrFUEz+5KKY+Nj8mPtYQGr/EXw4+G79VPhdvDj6f1BG+sP+4vWV/4b0+NWk+p+G2vTBNXz082OW+jDG8vpfzdj4yp3u+3gIDvsAyoD3lkXk+cDbkPtcTWD44FX4+wxuNvq9f7rzY7Q++piJ7PQPNQL5+DjC+qe4MPpv7j73PBUw9rwCSvt6QML6cmk8+GqI0PrSYXL3mspe+tokNvjOlwj7PBsk+nL8zPdgc/D2AVh89Ah/BvZXGsr3p75K+DKQHPgZSBL2Tu0G96YN3u0pkb77QxMG8c112PWPxYr4mxyA9oLlBPrX3LL4WNZm9Ud5uvhj/BD6rVFO9jKVePh8lFjuB+AA+2QAkPW3A0b3uDRq+wzTxvbrT071CTiY+9wBaPcgp070on3S+0hnUPbrvJb0wno8+w49TvkqoS75CPgA/ufiovE0fQL3cXYy+qLG6vulaFj43R3K+J528PX3dZr2exTq9NKKSPiDqWT21yAY9OGYgPRDQRj3vZnK82A12vt7DLD4IRZa92HypPQWypD5oEZ8+6d4AvfCq6j1JGRq+5yAYvmIOmTy7n4E+Yp1evlugjj1kvrU+Fr12vRocaT6Q24A9dFp7vqeCUT630JW+5zaEvhTq772AEUi9bR4OPd1LFb47ZR89wCckPK/uer6gj909cQ5aPnfIp73m5O+9kSOgPd88iT45oi0+8zVFPqmUIb6sYzc+HWXvPc6q+TzdLzS+Kv6YPhLrCL4oRbQ8hydhvtWa3z1Scgw+PtUWPckJG74+dDi+ktmNPgaKAT58RBE9OOHYPbP5k77iy4C+JKyDvViMfL6pKg2+IyJFPpiMPz1+BI+9ACEpO1IrnT5VEaY9M5ehPoBzcD2jKf66yO8YPWg5jD4kLNs98Ad7PlTzbz5aOXu+LATMPaR9Iz78kpi9KM1CvQDGAzznr5i+oCCovMXSA77wx7A84lQmPtWDdb7U9Rs+wG34PUbviz65W8A9gSIUvofQDT0aE+U7",
        "vV6ovQ5NNb416YO+pCEnPqqRKb6uQSe/LXm+Pj4nxr6+toU+2+3bvkGdRr7q1oE+IE65PeNKjD6Ckfu9DWydvptiEj4J0Gg+gGt/PieERr6FIuO+bI8XPudwCr4qQ5a+KPh5PY1XGL/K4ZW+NazCPlATZj7cvuS+FCcXPlc8uj7AgQU+0IOkPa0RZL7xJEy9fZvYviyTaT4GVlI+w3lyvqSuT764zVS+rO4zPrcd2r1gf3A+Hj6bviSt4T2Vu7c+GN1oPbXZSD4Cizs+KJk1uwUctT2YUow9ssWSviP8vrwiWL+8LXgdPo/hHT7E3/E9rmnDPUW9h74JoYC+EXx/PgYDir7BzUY9nyqZPvrwaT4gtUk9zbMgvqyjyj1OW9I+solNPgWTBj6w4Di+l9VovjA9zTyu/o6+CEdCvkBAVTwgSpA+ljcBPsDWoTvqsZC+p6mWvjjhAb5Gpa69KGNWPgRZMz7Ey5A9kA1kPYLMzb13iB6+Qj6+vQWiH74gv24+oSidvvs0yj2loxs+4CRCvpAE7L3Jm2A+dlkbvm/uj7671H++6mkkvljKGr7+MSo95m2svT9OsL38gAy+3Wa/vRTuYj5l0LQ+9nkFvsaMEj6pP709SSYbvmef5zx55VY+pQC9Pl69Ir5sx8U9n+olvkehl76LaLe9CfyhPm93fD54cFu9ZT5uPg4TJT77D2k+bernvp+BEr7MBCk+7lT5PQhj6z1MtYq9bOYbvrvzIb1M+GY9+7GCPhBYkT1CV4u+EvUOPvgCIb6pR1c9pxGMvuvRE75kW3E+EnCMvqTzDT5Ox6O9knu2PiCyPz13hSe+niomPmMuBLwoRkY+moVxPttYBz5vCu492cZBPrfokz3YRpi+wsoVPhGCdT6k+02+a9cIvhzK6j2k4HW93esaPqd7wT0MG5E9itmYvYpuz70Un4I+PIesPEfOYD4L9Py9k/PCPkWtyj4jmIK+rf5ZvpelCL7nuZo+XXYYvgxsuj3+HjE+YeAWPo5qmL5QRJu9",
        "uNWHvvbiS74AtLy8ctJFPmFcz70t6Ry9FXzEPdTTybx6bYQ+UT/jPGSYjL4Dc6S9PmBKvqWA07756q89IESGPnBy+jx9OIm+oJP4PMnTVj0AhKI+vZsnveCEED2aYXu+V7vPPM9ubz4XjV69xqhNPq46Ub7HY4c9NtdEPWFH+zxHCYm+WM/sPRbbgD0xbJi+gPKbPIPzGD6MBB0+lEZ+Pr50Tj6wG54+DnyQvlKDOz497Xi+NFksvAiJV72TADC+5NtsvZ4kjL05W5i+GUogvlARAj6vtES8zUY1PqLVgL5Keo2+/j2avoZtk76XLI4+D1OHPT0etD7UcF2+wSqVPYXqmj7CD3E+PuJ3vg2GmLyV95I+ugLpPPwHKT74JOM8Ph4XvmhBlz4Q76E+Bw6YvvD8fT4fBke9IsGEPsh5373MJBK+oTFjvRL4j729pl89wuS1vsdwUr7YBZe+7RqIvhHA/LwkgsO8WdiDPuwTCz7YBuW9E+Y1Pt0VdTsX0jU+JIOAPe4Vjz5Amks+bj5WvkrLhT5SUEU+AAB1usKdYD6XVko9py2DvvO+Db347Wm+VEk8PmCjqz58III+IWSTPZo2TL6wkUC+I9trPmSw+7163AM+fAS/PgCt9bxKz5o9XyoPvMhxsr20Vj6+X3pfvrtsIL7aEvq9sOaPPMCzVzxWN5s+zA4vvvpiSj7gmAG9IyFDvnHLF777mUO+FwOwvUpaSj7niym96PM9PQcCpzuamog+lkGHPSr4Br54NYQ9+Cq3vU7pi73/Ju27oA6QvqnhRD5WliM+MHt6PljgMb1AaUU8ktEXvd0aEr4yG2+9wPaTPu+Gbz7gDra8v0c1vUlFCT6+QF++lhBIvq+HFL3QWg8+OMx8PZbObb4rCjs9lncPvYNdMb6n87o9tla4vfae+72bkgM+tLkOvb1dzr2ifQ0+bfueO0ICjj6WyJW+5z0EvrkOhL0sf2q+3T+JvjRWgT3UIvY9sOP5PEDUED2Y6oS7COZAvgKWS77eSoC+",
        "YHOFvkJ/WD4UzK491GpDPugtJD44zAU+kRcnvuRDSj0+JHS+MmoevnS0lD4Qot29jzsKvoQWgj4Q1vy8blaBPjibF76pJJi+RAvrvcq6iL08jdi9BPbuvRBXXj7qsLe9EE2nvJAVkLwgZZE+WAEcPmQCtD2gAko8oANtPSaYLD5a8YW+09w0vny8Lr27Zge86zPVPbRulj18cZy9c4aiPAQwjb1YFFk+b0+NPgTxkr24JIW+FQkkPqwHcL5/I5o+35DLvT0Znr1w7iC9eOJivQ8D0T4I1lK+fNsTvvvpl7523Mm+Noe6vtQPUT7Dch2+RFBBvs5xZDpzCo87GyggPaihRz13RRC+5zdzvsjisj3xk8Q+ktAkPvBwoD2J16W+a5FsPjRdoT0xlpG+1FVJPty6aj48UMA+oW+Cvvg22D3Q+pk+fJjaPayLKT7xdkm+3PY1PgK0wL5HfSu+OYUWPssIZb0tXaw+lOv3PQR2pL5W2rq95c8DvvMbnb56+pe+KwE7Phnlob42PKm9a7+VvtgkSD6arSY9EZwIvXtr77yDBpm+JXwUPd7IBz6Ix9A9b08Bv7EIab62ehc+DFCHPYI3Qr6Nf6u9bVCWPT3Lg70gtAi+Ov0pPfpUej75huA9+kOWvoVe8z2l4YU+XNiSPejYcb7SbwQ+wLwRvt7phz5WM7S9P73VPQDsZLp2+XA+Ujb3PdTNlT3H50e+Nhc0PoJqOT1rlBu9m5nSvRlZSz4gwZO9PdnwvTIoKbxISos+DL2PvZAaJr7AlZE9bgYOvs3KZ71O9KQ+nr5UvlX2UD4="
      ]
    },
    "dense_2": {
      "bias": [
        "KfTQvFfx8T1JZAw6OjsVPUInYD3yTKU7rvFMvAbxLrwLqKY8jsbtPJIIULwxvFA9AAAAALjX2bzSGmY9"
      ],
      "weights": [
        "Qz3pvivjBL/anuU+jWj5PnXlhD7fIw4/iRlQvllCzT4xUDk9v8XWvpFWsj7qKKA9PLPcPWaDgLsfFi0/MaIMPjM/0j4Fzd88GUqtPqDrJD4nCSG+DnRPPl+4pr5mlDS+ZgaDPBZui75qr0E9kQ+xvkHkrr4+x6W8MQDFvjORgz6Mtw2+e3lzvjGTV76OWCG+cOYtPcYaob2Oza++5waUvrA/njwBMwi+gCncvADwvjwsVsu+rCgUvnWRmb7AMyQ9Bq9lPa20jj6u3x0+TQKePkUEtD4caqW96edzPngNo75Bz5i+Hx6EPhQitz3ZRBG+8GZJPkRKhj4KvIk+qrXjvTmnAL5vvxc8vv8hvsJoVz6Qw448hlYBPrjV2b4/rv29O+e4vg2AiL1rbMk+QL0YvruM9z576ui80aWPvqe+hT56S5M+7B50Pk453z1jbYo9eA2tPuPcuz3o4kK+qL0TPWOsy7553LI+P3ygvob8kL7yn9e+nyv9PR+8G76E6Ls+mrc2voqi07zNx8O+4cluvliJhr6fGZQ+1nx2PtVt5r1w5sO+08ISPuzr4r7KHSu9ItpLvo1lhr7v8+G8jOqdvbmbrr6UGIE+jpzAPZBsjL6VOrw+ADqFO1BlTTuNjQ8+Yl+avsFptj4Suww+3GuvvnKVxL7Xp78+kheDvnB6Yz06GAQ+vXXJPiejjj4qgU0+ZemZPuhldb4Qa9u9ksHSvlkTyz33ZF2+/JOtvg0/LT1Z6RG/xHfzPet3Vr2MFxA/JqEMP3Qkg75wRWi+wqRiPmCdMb5ibdy+qNoaPjtYlD0ZlIU++pbQPmQ8HT23vFU+SGK2PfXEoz6rcDE+RouqPrZaXT5TQak+k3e1PpqWEj7+gbk8jk3wPnR2Z7xrSC89gzoXvhlsBb9HMfw9ppk3Pg/AKD0trQ8/uhNcvmAWkzziYhu/ofO5vtQ+Ez/4MrW+dS+4PgcYkT69JGa+IJcFvRa7m76dZHG+sdLHvqlmrz6veqc+0oYsPjMtWL4oF4e+",
        "gBw5PJNYsz50L4g9WYaKvkYugj6/9Y2+40vLvuvngj6e3M++gtTTvktvpL4VKE8+tXatPkxIPz7zJjI+TTmOvilqSz7rpgM+IKAqvQDU4rr4rRs9QdaWvmyFH7526kW+F9tuvu4Oej4SVwI+IFLGvLh+vL4ysIO+0AFIvoQ63j02GWw+h/QSvZvcjD7FMVy+gToOvniaiT73i7A+I5GnPao/nL5Kh8W+Pf9zvqDw5Lt3nLA++LRvPUKULL1MMps9M4mWPUcOrL6Qvpy+y3gKP4E0sT2VD1A/Pz1yPv7Rgb4tnKe+pjkRv2fht72uUQI/TD8RvpevHrz8jTQ/FmTVvT3kCT5dKf488C3ZPlCa1j6Yrg6+WHxfvjNQX71ac4A+f86UvhND0b02srE9VyZPvo02nD547eM+SqoQPpy7g709D44+tPjmvd4Ykb6V0s++CP3xvaxhrr3zFEa+F/21vhdBZL4c0oO+aRyDvlQ3+70IVG2+WNBgPrKL4z6aG728+O++vSBeD7yhPsE7ylhVvqjehj4Nm7w+Q277vLMMZb7+Xo49oGBGvSi/yL5+RwS+"
      ]
    },
    "dense_3": {
      "bias": [
        "2G0/PQAAAAAGHXc9AAAAAEPxPT1zgDq9sc49PSU4uTwBUYU9AAAAAA=="
      ],
      "weights": [
        "ueEFvzjK+L0+17Q+zaLJvidFED1VeYQ8JJTavhvaxj41Vyk92AvFvpnivD5kw8++gZ6NvpY7+b7d58c81OvUPou3ij7qwYI+7ibQvlxArb5pHhw/fnflvvoxXD5L+J0+qS0gP+RTCL4XBBg5puUav7/e7T6wBGO+U1eOPiaMFz43UvO8OA6ovSU/BT+aZzu+NYb1PUMEXb2xSiE+L6SDPn46KL4AjMy6bIcIP8pqRb7HaPA+r3aiPhbymD4Dzwu+VGfTPpgJ0L21/qk+2FnMvpp9w76YzJO+S20IP7DQlT4Ep889HdMFv7wuGD+2Gmm+UwrGvt5v5L4YlgM9UHzrvmGsvr6fkBy+bqUkPhiopr4AFKe+vvB3PkJ0v72OFfe+mFqQvvacP741KnC+3cEKvw6PQz6jgN++Nv0pvYyujj1a6Rc+KuETPqjZzD7rg8I+6Tv6vltDGD/5xoG9E5oFP6AFZL5ASOa+VYDJvgENy777sj8/BhUZPtLVgb2S+5Y+gu4iv8ELJT+AlSS/vFyBvrBZzb5sYl2+BQQgvVWphT7vevS+2w9QPogwuL7At3G9GRYdPtvijT5DpMc+ala4vuaVnj71You+FUnxPnyktT42wpY+ko7DvQwv1T7y/8S+I2fOvqEd0D6IZTU9d6C+vjSEnr0wVsq9jAygPZIEP77dHb++HSfwPlNzyr5cyqE96/kmP2wx470QXwC/xL7jPoSTob557QY/hXDfPfE9wj6M7Ok+IC2SvN4iib7AGIm8ujfVPWW5Er/7h8g+alAkPr8pHjtHtsw+"
      ]
    },
    "dense_4": {
      "bias": [
        "3+k7PQ=="
      ],
      "weights": [
        "1nS0PgjAyr35qiG/E/UTPzDUMT9p+Tq+9XsePwcnib+6hxQ/AEGovQ=="
      ]
    }
  }
}
