{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              4
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 5,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "dense_2",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "hash": "793271613bcd3c5a2d530c20a5b6c9a27ce93a7aeb6799b8ff8387082306316f",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      1,
      1,
      1,
      1,
      4
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            1,
            1,
            1,
            1,
            4
          ],
          "values": [
            "UqQlv3IUGD955pY/kdzfPw=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            1,
            1,
            3
          ],
          "values": [
            "nsBQPzRA8T3buog9"
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "dense_1": {
      "bias": [
        "AAAAAKBtgbwXyHm8M2SMPPRAg7w="
      ],
      "weights": [
        "QGtqvXl8bT0CRd49cJwJv4RFUb8UZx4/D7ogP3h2MD+IHjq/cfUWP2eHA7+40T++b8i7PvGFoj6rfFQ+4hmOvr8ODTzbNTi/9vLGPtwT6T0="
      ]
    },
    "dense_2": {
      "bias": [
        "FdyDvILyjLz2xIQ8"
      ],
      "weights": [
        "Hx9MvzdqEr+CVKG+zoUUP6bIo77Daqc9ThdHv6yfrL6nRk6/+Sn7PcvfB71YsTi/PIoTP7MINb9tty6/"
      ]
    }
  }
}
